{
    "credits": {
        "released": "2022-08-12",
        "execProducers": ["Davy Kamanzi"]
    },
    "tracks": [{
            "id": "1",
            "title": "Straight Bars",
            "runtime": "64",
            "style": ["Skit"],
            "synopsis": "<p>The first track on the album is a short clip from my 9th birthday party. It was during a period where we all decided to perform for each other, and one of the things I did was do a rap that many kids in Kenya (or Nairobi, at least) liked to do to feel like lyrical geniuses when I was growing up. The playful energy on this track is a preview of the energy I'm coming to this album with: I have things that I want to say, but I don't take myself too seriously as a rapper.</p><p>I decided against calling the track \"Intro\" or including that word in the title because I felt that would be generic; that dead horse has been flogged excessively throughout the music industry at this point, even just within Kenya.</p><p>The girl introducing me in the beginning is my half-aunt Ariane, and the other kids rapping and yelling alongside me are my brother Sidney and our old neighbours Eric and Jerry. Sido also makes a point to refer to me as \"Eclipse\" because he liked making fun of my big forehead, even though he's always had a fairly substantial one himself.</p>",
            "lyrics": "",
            "credits": {
                "writers": ["Davy Kamanzi"],
                "additionalVocals": ["Ariane Uwizera", "Sidney Kamanzi", "Eric Waithaka", "Gerald Kisia"],
                "mixMaster": ["Thee MC G'zay"],
                "recorded": [{
                    "studio": "The Kamanzi household",
                    "city": "Nairobi, Kenya"
                }]
            }
        },
        {
            "id": "2",
            "title": "Not a Rapper, Pt. 2",
            "runtime": "291",
            "style": ["Boom bap"],
            "synopsis": "<p>While coming up with ideas for a follow-up to <em>Not a Rapper</em>, I liked the thought of creating a Part II for its title track, even though it's not exactly an original idea in the world of hip hop. I had really enjoyed writing that song after getting inspiration from Noel Miller and the boom bap tracks he's done like \"Motor Yola\", and I wanted to drop some more bars on another song with no central theme or subject matter.</p><p>Before I continue, I realise that on the surface, it's disingenuous of me to say that I'm not a rapper, while doing the very thing that rappers do. The whole idea is to say that I have no major aspirations as a musician; I'm simply doing this to try and entertain people, grow my brand, and because I have fun doing it.</p><p>At first, I had only written one verse to a beat I found on BeatStars, but when G'zay sent me the beat I asked him to make, my vision for the song came together quickly and I felt the need to write another one, which ended up being the first verse. Seeing as I simply wanted bars and more bars, G'zay was an easy pick for a feature given his pedigree as a lyricist in the Kenyan hip hop scene. The fact that he also made the beat made me feel he would give the song some extra care overall.</p><p>Vktor Mirage was also an easy decision because I'd previously worked with him on \"Nairobi Tofauti\", so I knew exactly what he'd bring to the table. I've followed him and his music for years, both as a solo artist and as a member of Masai Black Gold, since I got to know him and the group's other members through my brother from their high school days.</p><p>After Vktor and I recorded our verses in the studio, I felt the track was still missing something, so I decided to try an intro and outro with Emmanuel Kisiangani, a veteran comic and host/MC that I've gotten to know while doing stand-up. I wrote the intro for him, but he came up with the idea of rambling in the outro while we were in the studio; on top of being funny, I think it serves as a nice break from all the rapping before heading into the next track.</p>",
            "lyrics": "",
            "credits": {
                "writers": ["Davy Kamanzi", "Daryl Kimani", "Stephen Otieno Mak", "Emmanuel Kisiangani"],
                "featuring": ["Vktor Mirage", "Thee MC G'zay", "Emmanuel Kisiangani"],
                "producers": ["Thee MC G'zay"],
                "arrangement": ["Thee MC G'zay", "DVK"],
                "mixMaster": ["Thee MC G'zay"],
                "interpolates": [{
                    "title": "\"Not a Rapper\"",
                    "info": "Song written by Davy Kamanzi and Andrew Haines, and performed by DVK for his extended play <em>Not a Rapper</em>"
                }],
                "recorded": [{
                        "studio": "Black Hole Records",
                        "city": "Nairobi, Kenya"
                    },
                    {
                        "studio": "ApolloCoustic Productions",
                        "city": "Nakuru, Kenya"
                    }
                ]
            }
        },
        {
            "id": "3",
            "title": "Twenny 21",
            "runtime": "241",
            "style": ["Afro rap", "Afropop", "Afroswing"],
            "synopsis": "<p>This is one of five songs that weren't originally planned for this album, which I wrote in December 2021. It's a song I wrote as a recap of my year, from my entry into the Nairobi stand-up comedy scene in January to my third-place finish at the South Africa Regional Finals of the Tekken Online Challenge in December. When I came up with the idea, I thought it would go well with a slow afrobeats song, so that's what I set out for when I found the beat on Dagi's BeatStars profile.</p><p>I was inspired to include the voice note from my girlfriend Joan at the end after listening to \"Woman\" by Little Simz and \"My Little Love\" by Adele, off their critically acclaimed albums <em>Sometimes I Might Be Introvert</em> and <em>30</em>, respectively. \"Woman\" left a greater impression on me because of the variation in the music's arrangement during the outro while the voice note plays (I thought the voices in the middle were particularly cool). That gave me the idea of killing most of the drums halfway through Joan's voice note while humming the melody of the chorus, with the Maasai chants I sampled from the \"Only\" beat creeping in the background.</p><p>Speaking of that voice note, it's one Joan had actually sent me on WhatsApp, though I chopped it up a little bit to get rid of the bits irrelevant to the song while still making it sound natural. I was previously mulling over including voice notes I had sent to my brother while going through an episode of depression in the middle of the year, but after giving it some serious thought I felt it would take too much away from what's supposed to be a hopeful song, aside from making it way longer than it needed to be. When I later got the voice note from Joan, it was almost as if the universe knew exactly what the track needed, even though she was simply sending some love my way.</p>",
            "lyrics": "",
            "credits": {
                "writers": ["Davy Kamanzi", "Dagi Philip Noel"],
                "producers": ["Dagi De BEATZ"],
                "arrangement": ["Dagi De BEATZ", "DVK", "Black Hole Records"],
                "additionalProducers": ["DVK"],
                "additionalVocals": ["Joan Wanjiru"],
                "mixMaster": ["Black Hole Records"],
                "samples": [{
                    "title": "\"Only\"",
                    "info": "Song written by Davy Kamanzi, Kevin Midonzi, and Alex Niragira, and performed by DVK for his studio album <em>Man of Substance</em>"
                }],
                "recorded": [{
                    "studio": "Black Hole Records",
                    "city": "Nairobi, Kenya"
                }]
            }
        },
        {
            "id": "4",
            "title": "Only",
            "runtime": "180",
            "style": ["Afro rap", "Afropop"],
            "synopsis": "<p>This is a song I wrote for the project during the Covid-19 lockdown the Kenyan government imposed in March 2021, and it's my girlfriend Joan's favourite for obvious reasons. It's a conceptual sequel to \"Black Queen\" from <em>Not a Rapper</em>, in that I was exploring the feeling of meeting this woman for the first time and later getting into a relationship with her, whereas here I've become much fonder of her through our highs and lows together.</p><p>I hadn't really come up with the premise for the song until I heard the beat on KDaGreat's SoundCloud, and as I did the feelings and ideas just started coming naturally. I wrote the first verse and previewed it on my Instagram that same night in April 2021. Being of Rwandese origin, this song is also interesting in that I was able to collaborate with a producer from Burundi, who himself collaborated with a fellow Burundian artist to make the beat. Aside from the song being a tribute to my girlfriend, I see it as a testament to the creative talent coming out of the heart of Africa.</p><p>After I was done recording the song, I listened to it countless times feeling like it was missing something. I then decided to get someone in to add some background vocals just vibing throughout the entire song, and with that in mind I remembered a singer called Zippie that Joan had introduced me to not long before. I reached out to her and when she eventually came in, AndyBolo and I had her do three different takes that we could play around with. She did an amazing job and I'm glad I decided to get her involved; the song now had some feminine energy and some extra sauce on top of the main course.</p>",
            "lyrics": "<div class=\"section\"> <h2>Intro</h2> <p><span class=\"ad-lib\">(Ooooh)</span> Uh</p> <p><span class=\"ad-lib\">(Woah-oah-oah)</span> DVK, DVK</p> <p><span class=\"ad-lib\">(Yeah, yeah, yeah, ayy)</span></p></div><div class=\"section\"> <h2>Verse 1</h2> <p>She's my black queen, my baby special</p> <p>Anytime she come around, I'm sentimental <span class=\"ad-lib\">(Sentimental)</span></p> <p>She challenge me from the physical to the mental</p> <p>So much so, I'm putting paper to pencil <span class=\"ad-lib\">(To the pencil)</span></p> <p>Wait, no, pencil to paper</p> <p>Fucking up my lines but I don't need no eraser</p> <p>'Cause she love me for who I am, all my flavours</p> <p>Even when I get under her skin like a sabre</p> <p>Pushing all her buttons like a calculator</p> <p>But she glad she have a man who can calculate her <span class=\"ad-lib\">(Calculate, calculate me now)</span></p> <p>The way she whine her waist, her body one to savour</p> <p>A nutter when I'm mashing up her flower like a baker <span class=\"ad-lib\">(Like a baker)</span></p> <p>Still got a couple man who would wanna date her</p> <p>Wanna get their hands on what her mama gave her</p> <p>Serving blue ticks, it's routine</p> <p>'Cause she happy with her boo, know what I mean?</p></div><div class=\"section\"> <h2>Pre-Chorus</h2> <p>Brown skin with the natural hair <span class=\"ad-lib\">(Oooh, natural hair)</span></p> <p>Anytime you're down, you know I'll always be there</p> <p>'Cause losing you, babe, I know I can't bear</p> <p>You're my only one, the other ones don't compare</p></div><div class=\"section\"> <h2>Chorus</h2> <p>I need your affection <span class=\"ad-lib\">(I need your affection)</span></p> <p>The way you hold me down, I need you in my section</p> <p>Such a star from your toes to your face <span class=\"ad-lib\">(From your toes to your face)</span></p> <p>Baby, there's no question <span class=\"ad-lib\">(Ain't no question asked)</span></p></div><div class=\"section\"> <h2>Verse 2</h2> <p>Sexy when she get possessive</p> <p>When them other girls are leaving comments in my DMs</p> <p>A little jealous, not obsessive <span class=\"ad-lib\">(Ohh-oh)</span></p> <p>'Cause she know in the end, I'm not pillow talking with them</p> <p>'Rona got her still waiting for her degree</p> <p>She found her match, and now she got referees <span class=\"ad-lib\">(Referees)</span></p> <p>Tryna get a job and survive in these streets</p> <p>Make a likkle money, buy some lavender sheets</p> <p>Putting up her feet, talking to her mama</p> <p>Getting the latest scoop of the family drama <span class=\"ad-lib\">(Family drama)</span></p> <p>Feeling sad 'cause she's slacking on being a dancer</p> <p>But she got a lot on her plate like a hungry father</p> <p>All she wanna do is go on vacay with me</p> <p>Hoping maybe one day I'll get on the knee <span class=\"ad-lib\">(To my knees)</span></p> <p>She's the only partner that I'll ever need <span class=\"ad-lib\">(Yeah, yeah, yeah, eh)</span></p> <p>Whether true or not, I guess we'll just have to see <span class=\"ad-lib\">(Oh-oh)</span></p></div><div class=\"section\"> <h2>Chorus</h2> <p>I need your affection <span class=\"ad-lib\">(I need your affection)</span></p> <p>The way you hold me down, I need you in my section <span class=\"ad-lib\">(Eh, yeah, yeah)</span></p> <p>Such a star from your toes to your face <span class=\"ad-lib\">(From your toes to your face)</span></p> <p>Baby, there's no question <span class=\"ad-lib\">(Ain't no question asked)</span></p></div><div class=\"section\"> <h2>Pre-Chorus</h2> <p>Brown skin with the natural hair</p> <p>Anytime you're down, you know I'll always be there</p> <p>'Cause losing you, babe, I know I can't bear</p> <p>You're my only one, the other ones don't compare</p></div><div class=\"section\"> <h2>Chorus</h2> <p>I need your affection <span class=\"ad-lib\">(I need your affection)</span></p> <p>The way you hold me down, I need you in my section <span class=\"ad-lib\">(Eh, yeah, yeah)</span></p> <p>Such a star from your toes to your face <span class=\"ad-lib\">(Mm-mm)</span></p> <p>Baby, there's no question <span class=\"ad-lib\">(Asked, asked)</span></p></div><div class=\"section\"> <h2>Outro</h2> <p><span class=\"ad-lib\">(I need your affection)</span> I need</p> <p><span class=\"ad-lib\">(Only, and I need your affe-)</span></p> <p>Your attention now <span class=\"ad-lib\">(Woooah)</span></p> <p>Mmmm <span class=\"ad-lib\">(Ayy)</span></p> <p><span class=\"ad-lib\">(I need your affection)</span> Mmmm <span class=\"ad-lib\">(Yeah)</span></p> <p>My baby, eh</p> <p>Yeah, yeah, yeah, yeah, ayy</p></div>",
            "credits": {
                "writers": ["Davy Kamanzi", "Kevin Midonzi", "Alex Niragira"],
                "producers": ["KDaGreat"],
                "arrangement": ["KDaGreat", "Black Hole Records"],
                "additionalVocals": ["Zippie Nyumu"],
                "mixMaster": ["Black Hole Records"],
                "recorded": [{
                    "studio": "Black Hole Records",
                    "city": "Nairobi, Kenya"
                }]
            }
        },
        {
            "id": "5",
            "title": "Masculine (Interlude)",
            "runtime": "150",
            "style": ["Afro rap", "Afro punk"],
            "synopsis": "<p>This is one of five songs that weren't originally planned for this album, which I wrote in December 2021. It started with a concept I created using stems from the \"Only\" beat, while adding different drums to give it a completely different feel, even at the same tempo. I chopped up parts of the Maasai chants, reversed them and looped them throughout, save for the middle and the end of the song, then messed around with the rest of the stems until I landed on an arrangement I liked.</p><p>The drums I'd used were painfully basic, so when I took my concept to the studio, AndyBolo basically replicated my patterns with much better drums. I know I like to say I'm not a rapper, but I'm definitely not a producer, so the fact that we kept my original tambourine in the mix was a tiny win for me.</p><p>The subject matter for the song came to mind once I was done building out my concept. I had done a few videos on toxic masculinity on my social media before, so it didn't seem out of character for me to explore the same topic on my album, especially as it relates to the (mis)treatment of women following a song where I talk about one of the most important women in my life.</p><p>I pretty much wrote all the lyrics in about an hour, and while I was doing that, I remembered that Master Trail had done a video on toxic masculinity for their YouTube channel, so I went back and watched it to see if there were interesting bits I could sample. Once I did that, I reached out to KT, who I knew from primary school along with Luigi, to ask for the group's blessing and the guys were more than happy to give it.</p>",
            "lyrics": "",
            "credits": {
                "writers": ["Davy Kamanzi", "Kevin Midonzi", "Alex Niragira", "Andrew Haines"],
                "producers": ["DVK", "Black Hole Records", "KDaGreat"],
                "arrangement": ["DVK", "Black Hole Records"],
                "mixMaster": ["Black Hole Records"],
                "samples": [{
                        "title": "\"Only\"",
                        "info": "Song written by Davy Kamanzi, Kevin Midonzi, and Alex Niragira, and performed by DVK for his studio album <em>Man of Substance</em>"
                    },
                    {
                        "title": "\"TOXIC MASCULINITY INTRODUCTION\"",
                        "info": "Video published by Master Trail for their YouTube channel on 15 November 2019"
                    }
                ],
                "recorded": [{
                    "studio": "Black Hole Records",
                    "city": "Nairobi, Kenya"
                }]
            }
        },
        {
            "id": "6",
            "title": "Simama Kando",
            "runtime": "196",
            "style": ["Drill", "Comedy"],
            "synopsis": "<p>This song is the most playful one in this section for sure, simply because of the dumb shit I say on the choruses (not that I didn't enjoy doing it). It's a song where I'm gassing myself up and trying to sound cool on the beat, but I guess it also serves as a reminder that I'm not going to spend the entire album trying to be serious.</p><p>The hi-hat patterns that waytoolost used on this beat made for a groove I'd never quite heard on a drill beat before, and it put me in more of a light-hearted party mood the second I heard the drums come in for the first time. The hook is the first thing that came to mind while I was vibing to the beat, and I tried building out some funny situations around it to catch the attention of the listener: Who starts a song by asking you if your breath stinks?</p><p>Placing this song where I did made sense because it serves as a bit of a break from the intensity that had been rising from \"Twenny 21\" to \"Masculine\", while it's also followed by another drill track at the exact same tempo that brings back the intensity with its subject matter, and I feel like that allows <em>Substance</em> to end on a punchy note before moving into <em>Sippin' and Trippin'</em>.</p>",
            "lyrics": "",
            "credits": {
                "writers": ["Davy Kamanzi", "Luca Urbaniak"],
                "producers": ["waytoolost"],
                "arrangement": ["waytoolost", "Black Hole Records", "DVK"],
                "mixMaster": ["Thee MC G'zay"],
                "recorded": [{
                    "studio": "Black Hole Records",
                    "city": "Nairobi, Kenya"
                }]
            }
        },
        {
            "id": "7",
            "title": "Super Police",
            "runtime": "212",
            "style": ["Drill", "Conscious rap"],
            "synopsis": "<p>This is another song I previewed on my Instagram (in July 2021) not long after writing it. With the rising cases of police brutality and all the scandals around procurement of PPE and other Covid-related materials for healthcare workers, I wanted to provide my own commentary on the struggles that many Kenyans were facing at the height of the pandemic to end <em>Substance</em> on a heavy note. I found the beat for this song the same night I found the beat for \"Simama Kando\", which was easy because both were produced by waytoolost.</p><p>One of the reasons I love this song is because it's full of fighting game references, which of course I would appreciate as an active member of the FGC (fighting game community). Even the title itself is a reference; aside from being a sarcastic description of Kenyan police, it's also a nickname given to Lei Wulong, the Jackie Chan tribute character from <em>Tekken</em>.</p><p>As someone who is not a rapper, I'm particularly proud of myself for the first line in the second verse, which references jinns (demons) in Islamic mythology, as well as Jin Kazama and his father Kazuya Mishima from <em>Tekken</em>, both of whom carry a genetic abnormality known as the Devil Gene that allows them to transform into their \"demonic\" alter-egos. Aside from <em>Tekken</em>, characters from <em>Dead or Alive</em>, <em>Mortal Kombat</em> and <em>Street Fighter</em> are also referenced.</p>",
            "lyrics": "",
            "credits": {
                "writers": ["Davy Kamanzi", "Luca Urbaniak"],
                "producers": ["waytoolost"],
                "arrangement": ["waytoolost", "Black Hole Records"],
                "mixMaster": ["Thee MC G'zay"],
                "recorded": [{
                    "studio": "Black Hole Records",
                    "city": "Nairobi, Kenya"
                }]
            }
        },
        {
            "id": "8",
            "title": "Grime or Drill? (Skit)",
            "runtime": "189",
            "style": ["Drill", "Comedy", "Skit"],
            "synopsis": "<p>This skit is based on an actual conversation I had with Amandeep Jagde (hilarious stand-up comic) on the very same topic during an open mic with Punchline Comedy Club at Two Grapes in Hurlingham, which he references somewhere along the way. The song that prompted him to ask me the question that day was \"Nairobi Tofauti\", which DJ OCS always plays when I'm introduced to the stage (maybe that'll change with the release of this album).</p><p>I wrote a script for the skit sometime after the conversation and sent it to Aman. He ended up liking it and we eventually laid it down in the studio, though he ad-libbed most of his lines to fit his own vocabulary and cadence, and even added some funny comments of his own off the top of his head; if you pay attention, you can tell when he's reading and when he's just riffing, which I feel adds to the humour of the whole thing.</p><p>The skit initially wasn't accompanied by any music, but after a while I felt that it would be difficult for a casual listener to get through, given that it was more than 3 minutes of plain dialogue. AndyBolo and I first started thinking about adding music after Aman suggested using some elements of grime and drill at points when we reference them, but that didn't really go anywhere. At home, I started playing around with the stems for \"Simama Kando\" and \"Super Police\" (both 138 BPM), and suddenly the idea of combining the two for some laid-back background music started coming together.</p>",
            "lyrics": "",
            "credits": {
                "writers": ["Davy Kamanzi", "Amandeep Jagde", "Luca Urbaniak"],
                "featuring": ["Amandeep Jagde"],
                "producers": ["waytoolost"],
                "arrangement": ["DVK", "Black Hole Records"],
                "mixMaster": ["Black Hole Records"],
                "samples": [{
                        "title": "\"Simama Kando\"",
                        "info": "Song written by Davy Kamanzi and Luca Urbaniak, and performed by DVK for his studio album <em>Man of Substance</em>"
                    },
                    {
                        "title": "\"Super Police\"",
                        "info": "Song written by Davy Kamanzi and Luca Urbaniak, and performed by DVK for his studio album <em>Man of Substance</em>"
                    }
                ],
                "recorded": [{
                    "studio": "Black Hole Records",
                    "city": "Nairobi, Kenya"
                }]
            }
        },
        {
            "id": "9",
            "title": "Combi",
            "runtime": "215",
            "style": ["Boom bap", "Comedy"],
            "synopsis": "<p>This is one of five songs that weren't originally planned for this album, which I wrote in December 2021. I found the beat on BeatStars while looking for a mellow boom bap beat to follow the skit with Aman, and seeing as I told him I'd be going out with some friends afterwards, coming up with ideas for this song was fairly easy.</p><p>In many ways, this song pays homage to St. Mary's School (Saints), which I attended for all 11 years of my primary and lower secondary education. The title references a combination of a doughnut or mandazi, a samosa and a sausage that was by far the most popular snack among students during our mid-morning break time. BH later explained in the studio that the term also references certain traditional sexual practices in some Kenyan cultures, and Nigel alludes to mixing weed and alcohol in his verse, so make of the title what you will, I guess.</p><p>Given the Saints references, I felt it was only right that I feature fellow Saints alumni on the track, and that led me to Nigel and K-Spot, both of whom were in my year in primary school, left when I joined high school and I've occasionally kept in touch with since. Nigel ended up being the only one not to reference Saints in his verse outside of the song title, but I still really liked what he and Spot brought to the table. His intro is also where I got <em>Sippin' and Trippin'</em> from as the title for Part II of this album.</p><p>I wrote the outro at the end for BH to do as a segue into the next track, and I liked how he complimented the subdued nature of the beat at that point with his booming voice. His participation also made sense in that he also went to Saints; he was a year ahead of me when we were in high school.</p>",
            "lyrics": "",
            "credits": {
                "writers": ["Davy Kamanzi", "Malik Atterbury", "Fidel Owuor", "Kenneth Mbova Jr."],
                "featuring": ["Nigel 187", "K-Spot"],
                "producers": ["Passtense"],
                "arrangement": ["Passtense", "DVK", "Black Hole Records"],
                "additionalVocals": ["BH"],
                "mixMaster": ["Black Hole Records"],
                "recorded": [{
                        "studio": "Black Hole Records",
                        "city": "Nairobi, Kenya"
                    },
                    {
                        "studio": "K-Spot's bedroom",
                        "city": "Stockholm, Sweden"
                    }
                ]
            }
        },
        {
            "id": "10",
            "title": "Askari Ako Jaba",
            "runtime": "",
            "style": ["Kapuka rap", "Comedy"],
            "synopsis": "",
            "lyrics": "",
            "credits": {
                "writers": ["Davy Kamanzi", "Andrew Haines", "Brian Haines", "Solomon Ndung'u"],
                "featuring": ["JESHI"],
                "producers": ["Black Hole Records"],
                "arrangement": ["Black Hole Records", "DVK"],
                "mixMaster": ["Black Hole Records"],
                "recorded": [{
                    "studio": "Black Hole Records",
                    "city": "Nairobi, Kenya"
                }]
            }
        },
        {
            "id": "11",
            "title": "Wake Up",
            "runtime": "207",
            "style": ["Trap", "Comedy"],
            "synopsis": "<p>This is a fun song I wrote to a trap beat I found on BeatStars, and from the outset I knew I wanted Cap on it given the production style on the most popular songs he's produced, and the reputation he's built for himself in Nairobi's shrap/alt-rap scene. I also knew I wanted to bring in a rapper who could match my light-hearted lyrics and the trap flows I set out to bring; I initially considered Nigel 187 since he had done similar tracks in the past, but later I went with Lilmaina instead because I felt he would do a better job of what I was going for (and also, to be frank, because the guy's been popping off with hit after hit, regardless of how much more expensive bringing him in would be).</p><p>I reached out to both Cap and Lilmaina in September 2021, and both showed interest. Cap sent me some beats which I went through, before settling on one that I wanted him to modify because I didn't think it fully matched the vibe I wanted. That process took months, to the point where Lilmaina wondered whether I'd just abandoned the song (which would be strange because I had paid him already), but eventually Cap came through after I asked him to sample \"Nimesota\" from my debut EP. In the studio, I worked with AndyBolo to add some extra sounds, and after some experimentation he fleshed out the beat nicely with sounds similar to those from \"Nimesota\", but used different instruments (like that beautiful French horn) or switched things up with some plugins.</p><p>Lilmaina came to the studio having written some of his lines but wanted time to finish his parts in the first verse, lay them down, then repeat for the second verse. Andy and I just used our phones while the beat looped and he did his thing, and we were really pleased with what he brought in the end. I'd already written the outro for him but told him to do it in a way that felt natural to him, so that part was really easy.</p>",
            "lyrics": "",
            "credits": {
                "writers": ["Davy Kamanzi", "Sammy Chepkwony", "Andrew Haines", "Jeremy Maina"],
                "featuring": ["Lilmaina"],
                "producers": ["Cap", "Black Hole Records"],
                "arrangement": ["Cap", "DVK", "Black Hole Records"],
                "mixMaster": ["Thee MC G'zay"],
                "samples": [{
                    "title": "\"Nimesota\"",
                    "info": "Song written by Davy Kamanzi, Andrew Haines, and Brian Haines, and performed by DVK and JESHI for DVK's extended play <em>Not a Rapper</em>"
                }],
                "recorded": [{
                    "studio": "Black Hole Records",
                    "city": "Nairobi, Kenya"
                }]
            }
        },
        {
            "id": "12",
            "title": "Tafuta Sponyo",
            "runtime": "216",
            "style": ["Afro rap", "Afropop", "Comedy"],
            "synopsis": "<p>This is the very first song I wrote for this project. I actually did it while writing <em>Not a Rapper</em> in the middle of 2020 and previewed it on my Instagram in November that year, but decided to leave it off the EP because I had bigger plans for it. I always felt it could be a hit if I took my time with it, since it's a song I felt many Kenyans would relate to and enjoy.</p><p>I found the beat in a random ad while browsing drill beats on BeatStars during the writing process for <em>Not a Rapper</em>, and while I had worked with Black Hole to create new beats for the rest of the songs I wrote, I didn't want to change anything with this one because I loved the beat too much. It also just didn't fit, and I was too broke to buy the beat at the time.</p><p>To this day I'll never understand how the premise for the song and its lyrics came to mind; I simply caught a vibe while listening to the beat and this is what came out. It also served as the foundation to build out the entire story for <em>Sippin' and Trippin'</em>, so it's a bit crazy to think that a whole six tracks may never have existed had I never wrote this song.</p><p>AndyBolo's writing credit may come as a surprise given that he doesn't appear anywhere, but he's the one that had me switch things up in the first and second chorus with the \"baby girl\" and \"buda boss\" lines, respectively. He brought it up while we were recording the song and I feel like it added a little extra spice to my flow, so I decided to give him the credit.</p>",
            "lyrics": "<div class=\"section\"> <h2>Intro</h2> <p>DVK</p> <p>Cheki, times are tough, man</p> <p>Sometimes you have to use your bodily assets to get the bag, you know what I'm saying?</p> <p>Ayy</p></div><div class=\"section\"> <h2>Verse 1</h2> <p>Najua karembo kanasomea UON</p> <p>Anapenda kuji-nice, frolicking with all her friends</p> <p>Shepu yake ajabu, huwezi comprehend</p> <p>Kila boy anamdai, wish they had her in their bed</p> <p>But they ain't getting no bread and she's tryna be a boss</p> <p>Tryna get some likes on the 'Gram with all the filters</p> <p>Kama huna class, anapendanga ku-floss</p> <p>Ye mwenyewe anamumunya njugu kwake bedsitter</p> <p>Unadai ku-party Naks, kejani kunaboo</p> <p>Lakini mabeshte jo, they won't pick up the phone</p> <p>Unataka kwenda salon juu nywele ime-beat</p> <p>Lakini mfuko, jo, pesa usha-delete, ayy</p> <p>Sasa unatembea loso</p> <p>Ukasalimiwa nje ya club</p> <p>Mzae amekuroga na ngoso</p> <p>Baby get your money up</p></div><div class=\"section\"> <h2>Chorus 1</h2> <p>Uko nyumbani na bado unasaka form?</p> <p class=\"ad-lib\">(Ayy, baby tafuta sponyo)</p> <p>Umeboeka na unadai kuwasha ndom?</p> <p class=\"ad-lib\">(Ayy, baby tafuta sponyo)</p> <p>Unadai Konyagi lakini umekosa job?</p> <p class=\"ad-lib\">(Ai, baby tafuta sponyo)</p> <p>Unakufa njaa na mandazi ya 20 bob?</p> <p class=\"ad-lib\">(Ayy, baby girl tafuta sponyo, ayy)</p></div><div class=\"section\"> <h2>Verse 2</h2> <p>Najua kasee kanasomea hapo Strath</p> <p>Piga toja na kabuti kila siku, looking dapper</p> <p>Madem wanamwona ye ni tall, dark and handsome</p> <p>Each of them dreaming to be loved by such a man</p> <p>Wanamsho, \"What's the plan? I wanna go out on a date\"</p> <p>Hana pesa ya ku-burn, watauma vako</p> <p>Focus yake kwanza ni putting food on his plate</p> <p>Buda anasunda keki kwa jiko ya charcoal</p> <p>Unadai ku-buy njumu za Nike juu ni moto</p> <p>Lakini unasaka pesa ukicheza lotto</p> <p>Unadai kupiga watu Tekken hapo Tric</p> <p>Lakini ulichoma pesa ukipiga liqs, ayy</p> <p>Sasa una-chill nje ya bar</p> <p>Then you see her pull up with the car</p> <p>Matha anasaka boy kunyandua</p> <p>Nigga, take your cheque ukimaliza kurarua</p></div><div class=\"section\"> <h2>Chorus 2</h2> <p>Boys wako na rieng but hudai kupanda matatu?</p> <p class=\"ad-lib\">(Heh, buda tafuta sponyo)</p> <p>Unatafutiwa deni na ule boy Kimatu?</p> <p class=\"ad-lib\">(Wueh, buda tafuta sponyo)</p> <p>Tokens zimeisha, ulikuwa unacheza FIFA?</p> <p class=\"ad-lib\">(Ayayayaya, buda tafuta sponyo)</p> <p>Una ubao but umechoka kula njiva?</p> <p class=\"ad-lib\">(Eh, buda boss tafuta sponyo)</p></div><div class=\"section\"> <h2>Bridge</h2> <p>Unadai ku-party Naks, kejani kunaboo</p> <p class=\"ad-lib\">(Sasa unatembea loso)</p> <p>Lakini mabeshte jo, they won't pick up the phone</p> <p class=\"ad-lib\">(Mzae amekuroga na ngoso)</p> <p>Sasa una-chill nje ya bar</p> <p class=\"ad-lib\">(Ukasalimiwa nje ya club)</p> <p>Then you see her pull up with the car</p> <p class=\"ad-lib\">(Nigga, get your money up)</p> <p>Unadai ku-party Naks, kejani kunaboo</p> <p class=\"ad-lib\">(Sasa unatembea loso)</p> <p>Lakini mabeshte jo, they won't pick up the phone</p> <p class=\"ad-lib\">(Mzae amekuroga na ngoso)</p> <p>Sasa una-chill nje ya bar</p> <p class=\"ad-lib\">(Ukasalimiwa nje ya club)</p> <p>Then you see her pull up with the car</p> <p class=\"ad-lib\">(Nigga, get your money up)</p></div><div class=\"section\"> <h2>Chorus 3</h2> <p>Umeleta wageni home lakini huna ugali?</p> <p class=\"ad-lib\">(Eh, buda tafuta sponyo)</p> <p>Unasaka nginyo na huna maji nyumbani?</p> <p class=\"ad-lib\">(Hmm, baby tafuta sponyo)</p> <p>Ati ile tenje mpya unadai ni thao tisa?</p> <p class=\"ad-lib\">(Wueh, buda tafuta sponyo)</p> <p>Ati nywele ni thao saba na hutaki kulipa?</p> <p class=\"ad-lib\">(Ah, baby tafuta sponyo)</p> <p>Lover toka ng'ambo, madam ametoka Moshi</p> <p class=\"ad-lib\">(Eish, buda tafuta sponyo)</p> <p>Tess amekuleta club na we ndio ulipe bill?</p> <p class=\"ad-lib\">(Ai, baby tafuta sponyo)</p> <p>Aunty wa Harrier anakudai shuma ya doshi</p> <p class=\"ad-lib\">(Ii, buda tafuta sponyo)</p> <p>Otis apige miti, bora tu uko na pill</p> <p class=\"ad-lib\">(Ayy, baby tafuta sponyoooo)</p></div>",
            "credits": {
                "writers": ["Davy Kamanzi", "Suksan Salarak", "Andrew Haines"],
                "producers": ["Thaibeats"],
                "arrangement": ["Thaibeats"],
                "mixMaster": ["Black Hole Records"],
                "recorded": [{
                    "studio": "Black Hole Records",
                    "city": "Nairobi, Kenya"
                }]
            }
        },
        {
            "id": "13",
            "title": "Withdrawal Symptoms",
            "runtime": "209",
            "style": ["Trap", "Comedy"],
            "synopsis": "<p>This is one of five songs that weren't originally planned for this album, which I wrote in December 2021. Its premise was initially meant for a potential stand-up bit, but since I felt it would fit nicely within the story of <em>Sippin' and Trippin'</em>, I decided to turn it into a song instead.</p><p>At the time of writing the song, I had listened to Cap's recently released debut album <em>All Caps</em> about three times, so I was in a space where I wanted to tap into his production style for this song as well as \"Wake Up\". I browsed through the beats he had sent me again and settled on one, but when I asked him for the stems, he told me the beat was already taken. That drove me to explore some of his collaborators at East Side Nation (ESN), eventually settling on Jami after finding three beats on his Instagram that I really liked.</p><p>I reached out to Jami in December 2021, and he eventually responded early the following month; he said that he didn't have the stems for any of the three beats because he'd had some serious issues with his laptop. When I settled on the beat I wanted, he recreated it, sent it to me and it turned out much better than the original. Moral of the story: Sometimes setbacks give you the opportunity to do something even better than before.</p><p>Around the same time I found Jami's beats, I was also thinking about getting a woman to tell in her own words what goes through a woman's mind when she's in her ovulation period and feeling hornier than usual. I'd recently discovered Groovy Jo's music and liked the bad bitch energy she brought on her song \"Big Ole Big Booty\", so I decided to look no further and reach out. I was really impressed with what she came up with and her decision to respond to my verse, rather than simply retelling it from her perspective (or rather the perspective of the older woman Lilmaina calls at the end of \"Wake Up\", which is what I initially envisioned).</p><p>The idea for the sample at the end came on the morning of my last studio session for the album and getting Ty's blessing to use it was easy, since I'd already gotten to know him through stand-up.</p>",
            "lyrics": "",
            "credits": {
                "writers": ["Davy Kamanzi", "James Mutunga", "Joan Nyabaro"],
                "featuring": ["Groovy Jo"],
                "producers": ["Jami"],
                "arrangement": ["Jami", "DVK", "Black Hole Records"],
                "mixMaster": ["Thee MC G'zay"],
                "samples": [{
                    "title": "\"The Ugandan accent\"",
                    "info": "Video published by Ty Ngachira for his Instagram account (@anto_ty) on 22 April 2021"
                }],
                "recorded": [{
                        "studio": "Black Hole Records",
                        "city": "Nairobi, Kenya"
                    },
                    {
                        "studio": "Pops Muzik",
                        "city": "Nairobi, Kenya"
                    }
                ]
            }
        },
        {
            "id": "14",
            "title": "STD",
            "runtime": "174",
            "style": ["Drill", "Rhumba", "Comedy"],
            "synopsis": "<p>In my opinion, this is definitely the silliest, most light-hearted song on this album, and makes for a really fun note to end it on. While I'd only ever thought about the song in terms of how it ends the story for <em>Sippin' and Trippin'</em>, AndyBolo pointed out after we recorded it that he also sees it as a fun way of highlighting real sexual health struggles and situations that many young Kenyans go through and can relate to. It's only fitting then that he was the one who came up with the warning in the chorus that he recorded himself: \"Ogopa STD!\"</p><p>I wrote this song to a Congolese-style afro drill beat I found on BeatStars, and that gave me the idea of having G'zay work on a benga/rhumba drill beat, which he really liked when I first pitched it to him. For the guitar sample, I first reached out to a guitarist I found on YouTube called Blessed Ben, but things didn't quite pan out with him. I later reached out to a producer called Ben Theuri, who I'd been following on Instagram for a little while, and while (in his own words) he had never worked on anything benga/rhumba before, he took some time to do his research, and eventually hit an absolute home run with the sample. With the new beat and its different feel, I had to make some adjustments to the lyrics and rewrite the outro, but most of the lyrics remained the same.</p><p>While I was plotting on featuring Lilmaina on \"Wake Up\", I also thought about having him use the silly voice he does on some of his videos for some ad-libs I had already recorded, which I felt would add to its light-hearted feel. He did his thing brilliantly in the studio once we were done with \"Wake Up\" and I'm really happy with how it turned out in the end.</p>",
            "lyrics": "",
            "credits": {
                "writers": ["Davy Kamanzi", "Daryl Kimani", "Benson Theuri", "Andrew Haines"],
                "producers": ["Thee MC G'zay"],
                "arrangement": ["Thee MC G'zay", "DVK"],
                "guitar": ["Ben Theuri"],
                "additionalVocals": ["Lilmaina", "AndyBolo"],
                "mixMaster": ["Thee MC G'zay"],
                "interpolates": [{
                    "title": "\"Withdrawal Symptoms\"",
                    "info": "Song written by Davy Kamanzi, James Mutunga, and Joan Nyabaro, and performed by DVK and Groovy Jo for DVK's studio album <em>Man of Substance</em>"
                }],
                "recorded": [{
                    "studio": "Black Hole Records",
                    "city": "Nairobi, Kenya"
                }]
            }
        },
        {
            "id": "15",
            "title": "Nairobi Tofauti (Remix)",
            "runtime": "140",
            "style": ["Drill", "Conscious rap"],
            "synopsis": "<p>This is one of the first songs I wrote for <em>Not a Rapper</em>, which I then previewed on my Twitch stream sometime in the middle of 2020. Black Hole had created a new beat for it as they had done with the rest of the songs on that project, but after dropping it, I always felt a desire to re-release it with the beat I wrote it to. I'd been browsing through drill beats on YouTube when I landed on this absolute banger that Saint Cardona had made.</p><p>As a kid from a middle-class background, I felt that I wouldn't be able to do the song and its subject matter justice by myself, so I started thinking about who I could bring in for a more \"ghetto\" perspective. My initial target was Smady Tings, who I've always considered the most lyrically adept member of Mbogi Genje, but at the time the fee their manager was demanding was too much for me.</p><p>After thinking through my options further, I realised I didn't even have to go that far when an old rapper friend of my brother's was around, so pretty much as soon as that occurred to me, I reached out to Vktor Mirage (who went by GuyMoja at the time). I was very familiar with his ability to tell stories from the hood in his music, and although I'd never heard him rhyme on a drill beat at that point, I never doubted his ability to deliver.</p>",
            "lyrics": "",
            "credits": {
                "writers": ["Davy Kamanzi", "Jhonny Leandro Sandoval Cardona", "Stephen Otieno Mak"],
                "featuring": ["Vktor Mirage"],
                "producers": ["Saint Cardona"],
                "arrangement": ["Saint Cardona", "Black Hole Records"],
                "mixMaster": ["Black Hole Records"],
                "recorded": [{
                    "studio": "Black Hole Records",
                    "city": "Nairobi, Kenya"
                }]
            }
        },
        {
            "id": "16",
            "title": "Slay King Remake (Vitu Sipendi)",
            "runtime": "165",
            "style": ["Drill", "Comedy"],
            "synopsis": "<p>Between this song and \"Nairobi Tofauti\", I've never been able to decide which one is my favourite from <em>Not a Rapper</em>. I really like this song as well because it was so fun to write, and I've always felt that other people with a similar upbringing to mine would especially be able to have fun with it. Like with \"Nairobi Tofauti\", I had long felt an urge to re-release this song with the beat I wrote it to.</p><p>Unlike \"Nairobi Tofauti\", however, I had to re-record this song in my bedroom because I didn't have the acapella track for it; AndyBolo had put in the acapella track for \"Safari-con Remake\" instead by mistake when he sent me the final masters for <em>Not a Rapper</em>. I saw that as an opportunity to match the vibe of the original beat I wrote it to, and I was thoroughly pleased with the result.</p><p>My inspiration for the flow on the second verse came from \"Meet the Woo\" by the late New York rapper Pop Smoke. He raps in a similar fashion towards the end of his verse and since I had been listening to a lot of his music when I wrote <em>Not a Rapper</em>, it's no surprise that he ended up being an influence on this song as he has been on countless other drill tracks.</p><p>S'Bling did a superb job with the beat by the way. It still kinda surprises me that a Nigerian man living in the Ukraine could produce something like that, also bearing in mind that he's made himself known primarily for making afrobeats.</p>",
            "lyrics": "",
            "credits": {
                "writers": ["Davy Kamanzi", "Onuche Samuel Ogboji"],
                "producers": ["S'Bling"],
                "arrangement": ["S'Bling"],
                "mixMaster": ["Black Hole Records"],
                "recorded": [{
                    "studio": "DVK's bedroom",
                    "city": "Nairobi, Kenya"
                }]
            }
        },
        {
            "id": "17",
            "title": "Only (Remix)",
            "runtime": "",
            "style": ["Afro rap", "Afropop"],
            "synopsis": "",
            "lyrics": "",
            "credits": {
                "writers": ["Davy Kamanzi", "Kevin Midonzi", "Alex Niragira", "Daryl Kimani", "Don Doulo"],
                "featuring": ["Thee MC G'zay", "Don Poppa"],
                "producers": ["KDaGreat"],
                "arrangement": ["KDaGreat", "Thee MC G'zay"],
                "additionalVocals": ["Zippie Nyumu"],
                "mixMaster": ["Thee MC G'zay"],
                "recorded": [{
                        "studio": "Black Hole Records",
                        "city": "Nairobi, Kenya"
                    },
                    {
                        "studio": "ApolloCoustic Productions",
                        "city": "Nakuru, Kenya"
                    },
                    {
                        "studio": "Lati Ace",
                        "city": "Nairobi, Kenya"
                    }
                ]
            }
        }
    ]
}