{
    "credits": {
        "execProducers": ["DVK"],
        "photography": ["Sticks & Stones Ltd"],
        "graphics": ["Brian Bett"],
        "visualisers": ["Brian Bett"],
        "website": ["Davy Kamanzi"]
    },
    "tracks": [{
            "id": "1",
            "title": "Straight Bars",
            "runtime": "64",
            "style": ["Skit"],
            "synopsis": "<p>The first track on the album is a short clip from my 9th birthday party. It was during a point where we all decided to perform for each other, and one of the things I did was do a rap that many kids in Kenya (or Nairobi, at least) liked to do to feel like lyrical geniuses when I was growing up. The playful energy on this track is a preview of the energy I'm coming to this album with: I have things that I want to say, but I don't take myself too seriously as a rapper.</p><p>I decided against calling the track \"Intro\" or including that word in the title because I felt that would be generic; that dead horse has been flogged excessively throughout the music industry at this point, even just within Kenya.</p><p>The girl introducing me in the beginning is my half-aunt Ariane, and the other kids rapping and yelling alongside me are my brother Sidney and our old neighbours Eric and Jerry. Sido also makes a point to refer to me as \"Eclipse\" because he liked making fun of my big forehead, even though he's always had a fairly substantial one himself.</p>",
            "lyrics": "<div class=\"section\"> <h2>Intro</h2> <p>Now I give it up for my man here</p> <p>He's got a song for y'all, so</p> <p>Give it up for him, man!</p> <p>Eclipse <span class=\"effect\">(applause)</span></p> <p>Ah!</p> <p>It's Eclipse!</p></div><div class=\"section\"> <h2>Verse</h2> <p>Moja, mbili, tatu, sura kama kiatu</p> <p>Watu- I me- I mean</p> <p>Mimi ni m-best, nimetoka West</p> <p>Nimevaa vest katikati ya chest</p> <p>Ukitaka soda, nitakununulia Krest</p> <p>Alhamdulillahi, wala sijawahi</p> <p>Ona mbuzi wahi</p> <p>Lamba mnazi juu ya mandazi</p> <p>Moja, mbili, tatu, sura kama kiatu</p> <p>Watu wa matatu wananyamba mara tatu</p> <p>Mimi ni mnoma, najua kusoma</p> <p>Na ukileta noma, nitakugonga kama ngoma</p> <p>Nilienda kwa Maasai ni- <span class=\"ad-lib\">(Niki-rap kiingereza, na-rap)</span></p> <p>Niki-rap kiingereza, na-rap <span class=\"ad-lib\">(Yo, yo, yo!)</span></p> <p>Niki-rap kiingereza, na-rap <span class=\"ad-lib\">(Yo, yo, yo!)</span></p> <p>Nilienda kwa Maasai, nika- <span class=\"ad-lib\">(Yo, yo, y-)</span></p> <p><span class=\"effect\">(laughter)</span> Nilienda kwa Maasai, nikaiba paipai</p> <p>Akanichapa na buibui, nikawika <span class=\"ad-lib\">(Yo, yo, yo!)</span></p> <p>Uui, waiwai! <span class=\"effect\">(laughter and applause)</span></p></div><div class=\"section\"> <h2>Outro</h2> <p>The end!</p> <p>Yeah! It's Eclipse! <span class=\"effect\">(laughter)</span></p></div>",
            "credits": {
                "writers": ["Davy Kamanzi"],
                "producers": ["DVK"],
                "additionalVocals": ["Ariane Uwizera", "Sidney Kamanzi", "Eric Waithaka", "Gerald Kisia"],
                "mixMaster": ["Thee MC G'zay"],
                "recorded": [{
                    "studio": "The Kamanzi household",
                    "city": "Nairobi, Kenya"
                }]
            }
        },
        {
            "id": "2",
            "title": "Not a Rapper, Pt. 2",
            "runtime": "291",
            "style": ["Boom bap"],
            "synopsis": "<p>While coming up with ideas for a follow-up to <em>Not a Rapper</em>, I liked the thought of creating a Part II for its title track, even though it's not exactly an original idea in the world of hip hop. I had really enjoyed writing that song after getting inspiration from Noel Miller and the boom bap tracks he's done like \"Motor Yola\", and I wanted to drop some more bars on another song with no central theme or subject matter.</p><p>I realise that on the surface, it's disingenuous of me to say that I'm not a rapper, while doing the very thing that rappers do. The whole idea is to say that my aspirations aren't limited to music; giving myself the space to explore my creativity in whatever medium I choose at any given moment, be it music, stand-up comedy, or whatever else, rather than letting people put me in a box by categorising me under one label. I also feel like some rappers often take themselves too seriously, whereas I'm just having fun making music that I like while trying to entertain people and get my name out there.</p><p>At first, I had only written one verse to a beat I found on BeatStars, but when G'zay sent me the beat I asked him to make, my vision for the song came together quickly and I felt the need to write another one, which ended up being the first verse. Seeing as I simply wanted bars and more bars, G'zay was an easy pick for a feature given his pedigree as a lyricist in the Kenyan hip hop scene. The fact that he also made the beat made me feel he would give the song some extra care overall.</p><p>Vktor Mirage was also an easy decision because I'd previously worked with him on \"Nairobi Tofauti\", so I knew exactly what he'd bring to the table. I've followed him and his music for years, both as a solo artist and as a member of Masai Black Gold, since I got to know him and the group's other members through my brother from their high school days.</p><p>After Vktor and I recorded our verses in the studio, I felt the track was still missing something, so I decided to try an intro and outro with Emmanuel Kisiangani, a veteran comic and host/MC that I've gotten to know while doing stand-up. I wrote the intro for him, but he came up with the idea of rambling in the outro while we were in the studio. On top of being funny, I think it serves as a nice break from all the rapping before heading into the next track.</p>",
            "lyrics": "",
            "credits": {
                "writers": ["Davy Kamanzi", "Daryl Kimani", "Stephen Otieno Mak", "Emmanuel Kisiangani"],
                "featuring": ["Vktor Mirage", "Thee MC G'zay", "Emmanuel Kisiangani"],
                "producers": ["Thee MC G'zay"],
                "arrangement": ["Thee MC G'zay", "DVK"],
                "mixMaster": ["Thee MC G'zay"],
                "interpolates": [{
                    "title": "\"Not a Rapper\"",
                    "info": "Song written by Davy Kamanzi and Andrew Haines, and performed by DVK for his extended play <em>Not a Rapper</em>"
                }],
                "recorded": [{
                        "studio": "Black Hole Records",
                        "city": "Nairobi, Kenya"
                    },
                    {
                        "studio": "ApolloCoustic Productions",
                        "city": "Nakuru, Kenya"
                    }
                ]
            }
        },
        {
            "id": "3",
            "title": "Twenny 21",
            "runtime": "241",
            "style": ["Afro rap", "Afropop", "Afroswing"],
            "synopsis": "<p>This is one of five songs I wrote in December 2021 that weren't originally planned for this project. It's a song I wrote as a recap of my year, from my entry to the Nairobi stand-up comedy scene in January, to my third-place finish at the South Africa Regional Finals of the Tekken Online Challenge in December. When I came up with the idea, I thought it would go well with a slow afrobeats song, so that's what I set out for when I found the beat on Dagi's BeatStars profile.</p><p>I was inspired to include the voice note from my girlfriend Joan at the end after listening to \"Woman\" by Little Simz and \"My Little Love\" by Adele, off their critically acclaimed albums <em>Sometimes I Might Be Introvert</em> and <em>30</em>, respectively. \"Woman\" left a greater impression on me because of the variation in the music's arrangement during the outro while the voice note plays (I thought the voices in the middle were particularly cool). That gave me the idea of trying to maximise the emotional impact of Joan's voice note by killing most of the drums halfway through it while humming the melody of the chorus, with the Maasai chants I sampled from the \"Only\" beat creeping in the background.</p><p>Speaking of that voice note, it's one Joan had actually sent me on WhatsApp, though I chopped it up a little bit to get rid of the bits irrelevant to the song while still making it sound natural. I was previously mulling over including voice notes I had sent to my brother while going through an episode of depression in the middle of the year, but after giving it some serious thought I felt it would take too much away from what's supposed to be a hopeful song, aside from making it way longer than it needed to be. When I later got the voice note from Joan, it was almost as if the universe knew exactly what the track needed, even though she was simply sending some love my way.</p>",
            "lyrics": "<div class=\"section\"> <h2>Intro</h2> <p class=\"ad-lib\">(Dagi on the beat)</p> <p>DVK</p> <p>Yo</p></div><div class=\"section\"> <h2>Chorus</h2> <p>2020, man was on the grind</p> <p>Opportunity wasn't coming my way</p> <p>Feeling like I'm getting left behind</p> <p>While them others running on the highway</p> <p>Now I'm in a better state of mind</p> <p>And I'm feeling more refined day by day</p> <p>2021 was a big one</p> <p>2021 was a big one</p></div><div class=\"section\"> <h2>Verse 1</h2> <p>Sitting inside with my handset</p> <p>Checking out the vibes on the Internet</p> <p>Came across this nigga looking fresh</p> <p>He was telling jokes, got a nigga interested</p> <p>Kinda impressed by what I see</p> <p>Had to invest, step on the scene</p> <p>Girlfriend is stressed by her routine</p> <p>Tryna give her some rest from her fatigue</p> <p>While I'm progressing on the stage</p> <p>Liking this comedy ting, can't complain</p> <p>Killing with the jokes, the mic is a 12-gauge</p> <p>Comics on a roll, then the lockdown came</p> <p>In a dark place like a phantom</p> <p>Fucking with my headspace, kwani wagwan?</p> <p>Mum said the numbers shouldn't lead to fixation</p> <p>Told me, \"Stop leaning on your expectations\"</p></div><div class=\"section\"> <h2>Chorus</h2> <p>2020, man was on the grind</p> <p>Opportunity wasn't coming my way</p> <p>Feeling like I'm getting left behind</p> <p>While them others running on the highway</p> <p>Now I'm in a better state of mind</p> <p>And I'm feeling more refined day by day</p> <p>2021 was a big one</p> <p>2021 was a big one</p></div><div class=\"section\"> <h2>Verse 2</h2> <p>Going back to the home of my ancestors</p> <p>Still don't have an ID 'cause I'm a foreigner</p> <p>New passport on the agenda</p> <p>Link up with my people, then back to Kenya</p> <p>They call me an alien, put me through a maze</p> <p>Even though I'm Kenyan, fam, born and raised</p> <p>But I'm cool, fam, always unfazed</p> <p>Finna do my first fifteen on the stage</p> <p>On the code, tryna turn a new page</p> <p>Feeling no regrets about the career change</p> <p>Slacking on the course, but I'm okay with my pace</p> <p>'Cause the clients coming in, and I'm finna get paid</p> <p>Running sets with the gang everyday <span class=\"ad-lib\">(Everyday)</span></p> <p>Banking cheques with my nigga from Spain <span class=\"ad-lib\">(Ehen)</span></p> <p>On my own way, feeling like Lars</p> <p>Grateful to be further than where I was</p></div><div class=\"section\"> <h2>Chorus</h2> <p>2020, man was on the grind</p> <p>Opportunity wasn't coming my way</p> <p>Feeling like I'm getting left behind</p> <p>While them others running on the highway</p> <p>Now I'm in a better state of mind</p> <p>And I'm feeling more refined day by day</p> <p>2021 was a big one</p> <p>2021 was a big one</p> <p>2020, man was on the grind</p> <p>Opportunity wasn't coming my way</p> <p>Feeling like I'm getting left behind</p> <p>While them others running on the highway</p> <p>Now I'm in a better state of mind</p> <p>And I'm feeling more refined day by day</p> <p>2021 was a big one</p> <p>2021 was a big one</p></div><div class=\"section\"> <h2>Outro</h2> <p>Hello, baby! How are you doing?</p> <p>I've missed you, and, uh</p> <p>I wanna let you know that I'm happy to have spent this year with you</p> <p>And to have had you, like, in my life throughout this year</p> <p>I'm happy that you came through for me massively, um, this year</p> <p>Um, I don't know how I could've done it without you</p> <p>Would've been pretty rough</p> <p>Uh, so I'm glad to have had you there</p> <p>I'm just, I'm just grateful right now</p> <p>My heart is just full knowing that I have such an amazing, amazing partner</p> <p>Okay, bye. Love you. Love you so much <span class=\"effect\">(kisses)</span></p></div>",
            "credits": {
                "writers": ["Davy Kamanzi", "Dagi Philip Noel"],
                "producers": ["Dagi De BEATZ"],
                "arrangement": ["Dagi De BEATZ", "DVK", "Black Hole Records"],
                "additionalProducers": ["DVK"],
                "additionalVocals": ["Joan Wanjiru"],
                "mixMaster": ["Black Hole Records"],
                "samples": [{
                    "title": "\"Only\"",
                    "info": "Song written by Davy Kamanzi, Kevin Midonzi, and Alex Niragira, and performed by DVK for his studio album <em>Man of Substance</em>"
                }],
                "recorded": [{
                    "studio": "Black Hole Records",
                    "city": "Nairobi, Kenya"
                }]
            },
            "missingFrom": ["mixtape", "base"]
        },
        {
            "id": "4",
            "title": "Only",
            "runtime": "180",
            "style": ["Afro rap", "Afropop"],
            "synopsis": "<p>This is a song I wrote for the project during the Covid-19 lockdown the Kenyan government imposed in March 2021, and it's my girlfriend Joan's favourite for obvious reasons. It's a conceptual sequel to \"Black Queen\" from <em>Not a Rapper</em>, in that I was exploring the feeling of meeting this woman for the first time and later getting into a relationship with her, whereas here I've become much fonder of her through our highs and lows together.</p><p>I hadn't really come up with the premise for the song until I heard the beat on KDaGreat's SoundCloud, and as I did the feelings and ideas just started coming naturally. I wrote the first verse and previewed it on my Instagram that same night in April 2021. This song is also interesting in that being of Rwandese origin, I was able to collaborate with a producer from Burundi, who himself collaborated with a fellow Burundian artist to make the beat. Aside from the song being a tribute to my girlfriend, I see it as a testament to the creative talent coming out of the heart of Africa.</p><p>After I was done recording the song, I listened to it countless times feeling like it was missing something. I then decided to get someone in to add some background vocals just vibing throughout, and with that in mind I remembered a singer called Zippie that Joan had introduced me to not long before. I reached out to her and when she eventually came in, AndyBolo and I had her do three different takes that we could play around with. She did an amazing job and I'm glad I decided to get her involved; the song now had some feminine energy and some extra sauce on top of the main course.</p>",
            "lyrics": "<div class=\"section\"> <h2>Intro</h2> <p><span class=\"ad-lib\">(Ooooh)</span> Uh</p> <p><span class=\"ad-lib\">(Woah-oah-oah)</span> DVK, DVK</p> <p><span class=\"ad-lib\">(Yeah, yeah, yeah, ayy)</span></p></div><div class=\"section\"> <h2>Verse 1</h2> <p>She's my black queen, my baby special</p> <p>Anytime she come around, I'm sentimental <span class=\"ad-lib\">(Sentimental)</span></p> <p>She challenge me from the physical to the mental</p> <p>So much so, I'm putting paper to pencil <span class=\"ad-lib\">(To the pencil)</span></p> <p>Wait, no, pencil to paper</p> <p>Fucking up my lines but I don't need no eraser</p> <p>'Cause she love me for who I am, all my flavours</p> <p>Even when I get under her skin like a sabre</p> <p>Pushing all her buttons like a calculator</p> <p>But she glad she have a man who can calculate her <span class=\"ad-lib\">(Calculate, calculate me now)</span></p> <p>The way she whine her waist, her body one to savour</p> <p>A nutter when I'm mashing up her flower like a baker <span class=\"ad-lib\">(Like a baker)</span></p> <p>Still got a couple man who would wanna date her</p> <p>Wanna get their hands on what her mama gave her</p> <p>Serving blue ticks, it's routine</p> <p>'Cause she happy with her boo, know what I mean?</p></div><div class=\"section\"> <h2>Pre-Chorus</h2> <p>Brown skin with the natural hair <span class=\"ad-lib\">(Oooh, natural hair)</span></p> <p>Anytime you're down, you know I'll always be there</p> <p>'Cause losing you, babe, I know I can't bear</p> <p>You're my only one, the other ones don't compare</p></div><div class=\"section\"> <h2>Chorus</h2> <p>I need your affection <span class=\"ad-lib\">(I need your affection)</span></p> <p>The way you hold me down, I need you in my section</p> <p>Such a star from your toes to your face <span class=\"ad-lib\">(From your toes to your face)</span></p> <p>Baby, there's no question <span class=\"ad-lib\">(Ain't no question asked)</span></p></div><div class=\"section\"> <h2>Verse 2</h2> <p>Sexy when she get possessive</p> <p>When them other girls are leaving comments in my DMs</p> <p>A little jealous, not obsessive <span class=\"ad-lib\">(Ohh-oh)</span></p> <p>'Cause she know in the end, I'm not pillow talking with them</p> <p>'Rona got her still waiting for her degree</p> <p>She found her match, and now she got referees <span class=\"ad-lib\">(Referees)</span></p> <p>Tryna get a job and survive in these streets</p> <p>Make a likkle money, buy some lavender sheets</p> <p>Putting up her feet, talking to her mama</p> <p>Getting the latest scoop of the family drama <span class=\"ad-lib\">(Family drama)</span></p> <p>Feeling sad 'cause she's slacking on being a dancer</p> <p>But she got a lot on her plate like a hungry father <span class=\"ad-lib\">(Heh)</span></p> <p>All she wanna do is go on vacay with me</p> <p>Hoping maybe one day I'll get on the knee <span class=\"ad-lib\">(To my knees)</span></p> <p>She's the only partner that I'll ever need <span class=\"ad-lib\">(Yeah, yeah, yeah, eh)</span></p> <p>Whether true or not, I guess we'll just have to see <span class=\"ad-lib\">(Oh-oh)</span></p></div><div class=\"section\"> <h2>Chorus</h2> <p>I need your affection <span class=\"ad-lib\">(I need your affection)</span></p> <p>The way you hold me down, I need you in my section <span class=\"ad-lib\">(Eh, yeah, yeah)</span></p> <p>Such a star from your toes to your face <span class=\"ad-lib\">(From your toes to your face)</span></p> <p>Baby, there's no question <span class=\"ad-lib\">(Ain't no question asked)</span></p></div><div class=\"section\"> <h2>Pre-Chorus</h2> <p>Brown skin with the natural hair</p> <p>Anytime you're down, you know I'll always be there</p> <p>'Cause losing you, babe, I know I can't bear</p> <p>You're my only one, the other ones don't compare</p></div><div class=\"section\"> <h2>Chorus</h2> <p>I need your affection <span class=\"ad-lib\">(I need your affection)</span></p> <p>The way you hold me down, I need you in my section <span class=\"ad-lib\">(Eh, yeah, yeah)</span></p> <p>Such a star from your toes to your face <span class=\"ad-lib\">(Mm-mm)</span></p> <p>Baby, there's no question <span class=\"ad-lib\">(Asked, asked)</span></p></div><div class=\"section\"> <h2>Outro</h2> <p><span class=\"ad-lib\">(I need your affection)</span> I need</p> <p><span class=\"ad-lib\">(Only, and I need your affe-)</span></p> <p>Your attention now <span class=\"ad-lib\">(Woooah)</span></p> <p>Mmmm <span class=\"ad-lib\">(Ayy)</span></p> <p><span class=\"ad-lib\">(I need your affection)</span> Mmmm <span class=\"ad-lib\">(Yeah)</span></p> <p>My baby, eh</p> <p>Yeah, yeah, yeah, yeah, ayy</p></div>",
            "credits": {
                "writers": ["Davy Kamanzi", "Kevin Midonzi", "Alex Niragira"],
                "producers": ["KDaGreat"],
                "arrangement": ["KDaGreat", "Black Hole Records"],
                "additionalVocals": ["Zippie Nyumu"],
                "mixMaster": ["Black Hole Records"],
                "recorded": [{
                    "studio": "Black Hole Records",
                    "city": "Nairobi, Kenya"
                }]
            }
        },
        {
            "id": "5",
            "title": "Masculine (Interlude)",
            "runtime": "150",
            "style": ["Afro rap", "Punk rap", "Conscious rap"],
            "synopsis": "<p>This is one of five songs I wrote in December 2021 that weren't originally planned for this project. It started with a concept I created using stems from the \"Only\" beat, while adding different drums to give it a completely different feel, even at the same tempo. I chopped up parts of the Maasai chants, reversed them and looped them throughout, save for the middle and the end of the song, then messed around with the rest of the stems until I landed on an arrangement I liked.</p><p>The drums on my concept were painfully basic, so when I took it to the studio, AndyBolo basically replicated my patterns with much better drums. I know I like to say that I'm not a rapper, but I'm definitely not a producer, so the fact that we kept my original tambourine in the mix was a tiny win for me.</p><p>The subject matter for the song came to mind once I was done building out my concept. I had done a few videos on toxic masculinity on my social media before, so it didn't seem out of character for me to explore the same topic on my album, especially as it relates to the (mis)treatment of women following a song where I talk about one of the most important women in my life.</p><p>I pretty much wrote all the lyrics in about an hour, and while I did that, I remembered that Master Trail had done a video on toxic masculinity for their YouTube channel, so I went back and watched it to see if there were interesting bits I could sample. Once I did that, I reached out to KT, who I knew from primary school along with Luigi, to ask for the group's blessing and the guys were more than happy to give it.</p>",
            "lyrics": "<div class=\"section\"> <h2>Intro</h2> <p>You'll start saying, \"Okay, it's the man's duty</p> <p>To pay for these dates, to pay for whatever, sijui, what is in the house\"</p> <p>In the event that that person actually has the capability of doing it</p> <p>You find that now the man, even him, he becomes- becomes very toxic in that</p> <p>\"Sababu nalipia hizi vitu, nakulipia hii, now I own you <span class=\"ad-lib\">(Oh, yeah)</span></p> <p>Now you have to start doing-\" You know?</p></div><div class=\"section\"> <h2>Verse</h2> <p>Kenyan in the mind, Rwandese in the flesh</p> <p>Spliff on my right, bad B to my left</p> <p>I'm goin' off tonight, swear to God, man, I'm vexed</p> <p>All these soft guys talking shit on the net</p> <p>Chaos in the streets, man are causing uproar</p> <p>Wanted to get in the sheets, 'cause he spent that dough</p> <p>Rejected the dick, the price was three floors</p> <p>And the verdict? \"Oh, she shouldn't have gone</p> <p>Nothing is for free, bitch, what did you expect?</p> <p>She was being naive, should've stayed in her bed</p> <p>Need to be more careful around these sick men\"</p> <p>How the fuck else do you find love then?</p> <p>Other way around, still would take an L though</p> <p>Give it up on first date, you would call her a hoe</p> <p>Treat your girl right, then they call you a simp</p> <p>Guess that's how it goes when you tail Amerix</p> <p>Now I'm not saying I wouldn't tell my daughter to watch her back</p> <p>But if ever she's assaulted at the hands of some dickhead</p> <p>I'm putting all the burden on the perpetrator instead of the victim</p> <p>Groping women 'cause they're looking fine ain't instinctive</p> <p>Whether short skirt or a booty short, listen</p> <p>Ukicheki mboch ameng'ara in the kitchen</p> <p>Washa comp and masturbate like Chris Griffin</p> <p>It's not all about young chicks, paying rent</p> <p>Going to the gym, following the three Fs</p> <p>Wanna cause a fuss if it's the woman getting bread</p> <p>If she take care of you, that don't make you any less</p> <p>I don't see the need for all the secrets</p> <p>All the condescension, all the pretense</p> <p>All they bring is bitterness and regrets</p> <p>Probably why your wife is cheating on the weekends</p> <p>Had a conversation once with this guy</p> <p>Said the world is always gonna be cold, why try?</p> <p>'Cause I'd rather leave a better world behind</p> <p>Than the one that I found when I came to this life</p> <p>It's 2022, still wanna trip</p> <p>When two guys get it on in the crib</p> <p>No one getting harmed, and it's none of your biz</p> <p>He can make his own decisions, let him suck that dick!</p></div><div class=\"section\"> <h2>Outro</h2> <p>Kwanza even the guys who, uh, actually end up talking about their feelings</p> <p>They talk about it after they're sad and they've drunk</p><p>And the problem is gone <span class=\"ad-lib\">(And the problem has gone!)</span></p> <p>It's gone</p> <p>\"Eh, bro, last year nilikuwa pabaya, bwana\" <span class=\"ad-lib\">(\"Manze!\")</span></p> <p>\"Eh, but this year…\" <span class=\"ad-lib\">(\"Huo dame alini-mess!\")</span></p> <p>\"Najua ni kitambo, but, huo dame…\"</p> <p>\"Eh, huo dame alini-mess. Haukumbuki hadi ile siku nilikuwa na-sweat macho?\"</p> <p class=\"effect\">(laughter)</p></div>",
            "credits": {
                "writers": ["Davy Kamanzi", "Andrew Haines", "Kevin Midonzi", "Alex Niragira"],
                "producers": ["DVK", "Black Hole Records", "KDaGreat"],
                "arrangement": ["DVK", "Black Hole Records"],
                "mixMaster": ["Black Hole Records"],
                "samples": [{
                        "title": "\"Only\"",
                        "info": "Song written by Davy Kamanzi, Kevin Midonzi, and Alex Niragira, and performed by DVK for his studio album <em>Man of Substance</em>"
                    },
                    {
                        "title": "\"TOXIC MASCULINITY INTRODUCTION\"",
                        "info": "Video published by Master Trail for their YouTube channel on 15 November 2019"
                    }
                ],
                "recorded": [{
                    "studio": "Black Hole Records",
                    "city": "Nairobi, Kenya"
                }]
            },
            "missingFrom": ["mixtape", "base"]
        },
        {
            "id": "6",
            "title": "Simama Kando",
            "runtime": "196",
            "style": ["Drill", "Comedy rap"],
            "synopsis": "<p>This song is the most playful one in this section for sure, simply because of the dumb shit I say in the choruses (not that I didn't enjoy doing it). It's a song where I'm gassing myself up and trying to sound cool on the beat, but I guess it also serves as a reminder that I'm not going to spend the entire album trying to be serious.</p><p>The hi-hat patterns that waytoolost used on this beat made for a groove I'd never quite heard on a drill beat before, and it put me in more of a light-hearted mood the second I heard the drums for the first time. The hook is the first thing that came to mind while I was vibing to the beat, and I tried building out some funny situations around it to catch the attention of the listener: Who starts a song by asking you if your breath stinks?</p><p>Placing this song where I did made sense because it serves as a bit of a break from the intensity that had been rising from \"Twenny 21\" to \"Masculine\", while it's also followed by another drill track that brings back some of that intensity with its subject matter, and I feel like that allows <em>Substance</em> to end on a punchy note before moving into <em>Sippin' and Trippin'</em>.</p>",
            "lyrics": "<div class=\"section\"> <h2>Chorus 1</h2> <p>Mdomo yako inanuka? <span class=\"ad-lib\">(Simama kando)</span></p> <p>Dem wako anazusha? <span class=\"ad-lib\">(Simama kando)</span></p> <p>Uko mbele ya TV? <span class=\"ad-lib\">(Simama kando)</span></p> <p>Ati morio ako na bibi? <span class=\"ad-lib\">(Simama kando)</span></p> <p>Ayy</p></div><div class=\"section\"> <h2>Verse 1</h2> <p>The 254, I be reppin' it</p> <p>Killing the flows when I'm steppin' in</p> <p>Two years ago, I was checkin' in</p> <p>I was unknown, Tekken</p> <p>Going back for seconds <span class=\"ad-lib\">(Ayy)</span></p> <p>'Cause you know I'm hungry <span class=\"ad-lib\">('Cause you know I'm, uh)</span></p> <p>Chapa kazi</p> <p>Why you staying comfy? <span class=\"ad-lib\">(Why you staying comfy?)</span></p> <p>Chapa kazi</p> <p>Now we making money <span class=\"ad-lib\">(Now we, uh)</span></p> <p>Gimme a pad, you'll be catching these hands</p> <p>'Cause I'm one of the best in the country <span class=\"ad-lib\">(My fren)</span></p> <p>Come to a show when we're doing the jokes</p> <p>Man, the folks lining up like rugby</p> <p>If she telling you no, itabidi you go</p> <p>Itabidi unyonge monkey</p> <p>No place for the thuggery <span class=\"ad-lib\">(Nah)</span></p> <p>Ata ka ume-jam</p> <p>Getting groovy with the smoke</p> <p>I'm baking up some grams <span class=\"ad-lib\">(I'm baking up some grams)</span></p> <p>Never slacked when I was broke</p> <p>Man, I was making plans <span class=\"ad-lib\">(Man, I was making plans)</span></p> <p>Looking back at all the growth</p> <p>Think I'll blow up like I'm Japan</p></div><div class=\"section\"> <h2>Chorus 2</h2> <p>School fees hujalipa? <span class=\"ad-lib\">(Simama kando)</span></p> <p>Homework hujanipa? <span class=\"ad-lib\">(Simama kando)</span></p> <p class=\"ad-lib\">(Simama kando)</p> <p>Mjaka ako na kidi? <span class=\"ad-lib\">(Simama kando)</span></p> <p class=\"ad-lib\">(Simama kando)</p> <p>Ati chapo ni ya fifty? <span class=\"ad-lib\">(Ah, ah, we baki nayo)</span></p></div><div class=\"section\"> <h2>Verse 2</h2> <p>Slay king number moja <span class=\"ad-lib\">(Ayy)</span></p> <p>Freshi juu hadi toja <span class=\"ad-lib\">(Ayy)</span></p> <p>Making plays, mi ni kocha</p> <p>Mi ku-fail, watangoja <span class=\"ad-lib\">(Mi ku-fail, watangoja)</span></p> <p>Mi ni beast ka Okocha <span class=\"ad-lib\">(Ayy)</span></p> <p>Hizi beats naziosha <span class=\"ad-lib\">(Hizi beats naziosha)</span></p> <p>Sitaki beef, wacha chocha <span class=\"ad-lib\">(Nah)</span></p> <p>Taking shots like Kenosha <span class=\"ad-lib\">(Grr!)</span></p> <p>I was broke, nilisota</p> <p>Now the numbers goin' up <span class=\"ad-lib\">(Now the numbers goin' up)</span></p> <p>Hapo nilikuwa na jeshi in the booth</p> <p>We smokin' up <span class=\"ad-lib\">(Ss! Ss!)</span></p> <p>On my shit, I'm working hard</p> <p>I'm in the gym, I'm tonin' up <span class=\"ad-lib\">(I'm in the gym, I'm tonin' up)</span></p> <p>Tryna raise the bar and make it far</p> <p>I'm never slowin' up <span class=\"ad-lib\">(Chill, chill, chill, chill)</span></p> <p>Ayy, lemme relax kidogo</p> <p>Mavida zangu hazitaki hasira</p> <p>Wacha kuleta zogo</p> <p>Kusaka beef na uko nyuma ya keyboard</p> <p>Acha kumea kisogo <span class=\"ad-lib\">(Acha kumea kisogo)</span></p> <p>Funga mdomo na upige works</p> <p>We bado unachezea ligi ndogo</p> <p>Hizo siasa wachia Kabogo</p> <p>Kudanganya watu na kula hongo</p> <p>I'm a gem in the rough, utadhani ni Congo</p> <p>Running amok, utadhani ni Sonko, ayy</p> <p>Yo, if you wanna follow me</p> <p>You can catch me on YouTube and IGTV <span class=\"ad-lib\">(Ehen!)</span></p></div><div class=\"section\"> <h2>Outro</h2> <p class=\"ad-lib\">(Simama kando)</p> <p class=\"ad-lib\">(Simama kando)</p> <p class=\"ad-lib\">(Simama kando)</p> <p class=\"ad-lib\">(Simama kando)</p> <p>Ayy, boss <span class=\"ad-lib\">(Simama kando)</span></p> <p>waytoolost <span class=\"ad-lib\">(Simama kando)</span></p> <p>DVK <span class=\"ad-lib\">(Simama kando)</span></p> <p>Man like G'zay <span class=\"ad-lib\">(Simama kando)</span></p> <p class=\"ad-lib\">(Simama kando)</p></div>",
            "credits": {
                "writers": ["Davy Kamanzi", "Luca Urbaniak"],
                "producers": ["waytoolost"],
                "arrangement": ["waytoolost", "Black Hole Records", "DVK"],
                "mixMaster": ["Thee MC G'zay"],
                "recorded": [{
                    "studio": "Black Hole Records",
                    "city": "Nairobi, Kenya"
                }]
            }
        },
        {
            "id": "7",
            "title": "Super Police",
            "runtime": "212",
            "style": ["Drill", "Conscious rap"],
            "synopsis": "<p>This is another song I previewed on my Instagram (in July 2021) not long after writing it. With the rising cases of police brutality and all the scandals around procurement of PPE and other Covid-related materials for healthcare workers, I wanted to provide my own commentary on the struggles that many Kenyans were facing at the height of the pandemic to end <em>Substance</em> on a heavy note. I found the beat for this song the same night I found the beat for \"Simama Kando\", which was easy because both were produced by waytoolost.</p><p>One of the reasons I love this song is because it's full of fighting game references, which of course I would appreciate as an active member of the FGC (fighting game community). Even the title itself is a reference; aside from being a sarcastic description of Kenyan police, it's also a nickname given to Lei Wulong, the Jackie Chan tribute character from <em>Tekken</em>.</p><p>As someone who is not a rapper, I'm particularly proud of myself for the first line in the second verse, which references jinns (demons) in Islamic mythology, as well as Jin Kazama and his father Kazuya Mishima from <em>Tekken</em>, both of whom carry a genetic abnormality known as the Devil Gene that allows them to transform into their \"demonic\" alter-egos. Aside from <em>Tekken</em>, characters from <em>Dead or Alive</em>, <em>Mortal Kombat</em> and <em>Street Fighter</em> are also referenced.</p>",
            "lyrics": "<div class=\"section\"> <h2>Intro</h2> <p>Yo, DVK</p> <p>Yeah</p> <p>Yo</p></div><div class=\"section\"> <h2>Chorus</h2> <p>Ever since the virus</p> <p>Ni kubaya in these streets <span class=\"ad-lib\">(Streets)</span></p> <p>Down to my final shillings</p> <p>And I can't get no relief <span class=\"ad-lib\">(Nah)</span></p> <p>No space in the ICU</p> <p>Turned away just to be deceased <span class=\"ad-lib\">(Deceased)</span></p> <p>And it's almost curfew</p> <p>Watch your back for the super police</p> <p>Ever since the virus <span class=\"ad-lib\">(Uh)</span></p> <p>Ni kubaya in these streets <span class=\"ad-lib\">(In these streets)</span></p> <p>Down to my final shillings</p> <p>And I can't get no relief <span class=\"ad-lib\">(Nah)</span></p> <p>No space in the ICU</p> <p>Turned away just to be deceased <span class=\"ad-lib\">(Deceased)</span></p> <p>And it's almost curfew</p> <p>Watch your back for the super police</p></div><div class=\"section\"> <h2>Verse 1</h2> <p>Heh</p> <p>Gava wame-doze ka Eliza <span class=\"ad-lib\">(Sleepin')</span></p> <p>Raia analia ako broke</p> <p>Na ma-MCA wana-buy Land Cruiser</p> <p>Doccie walikindwa</p> <p>Form ya doh tumechoka kuuliza</p> <p>Billions coming in loans</p> <p>But zina-vanish ka Hayabusa <span class=\"ad-lib\">(Woosh, woosh)</span></p> <p>Just kickin' it like Hwoarang <span class=\"ad-lib\">(Chillin')</span></p> <p>Feds walikam thru, ni curfew <span class=\"ad-lib\">(Feds walikam thru, ni curfew)</span></p> <p>Mara ni vita</p> <p>Venye damu ina-flow, utadhani bafu</p> <p>Kutegea boda tao usiku</p> <p>Makarao will disturb you</p> <p>I got off safe, man, I'm lucky</p> <p>Chloe alihandwa ka fyatu</p> <p>This month ni mara ya tatu</p> <p>How many times will we accept</p> <p>Sanse kuchemsha fimbo</p> <p>Like Negan from Walking Dead? <span class=\"ad-lib\">(How many?)</span></p> <p>Stance ni intimidation</p> <p>So nafaa kucheza defence</p> <p>No goals in this game</p> <p>Ukifungwa, unalala ndani my friend</p></div><div class=\"section\"> <h2>Chorus</h2> <p>Ever since the virus</p> <p>Ni kubaya in these streets <span class=\"ad-lib\">(Streets)</span></p> <p>Down to my final shillings</p> <p>And I can't get no relief <span class=\"ad-lib\">(Nah)</span></p> <p>No space in the ICU</p> <p>Turned away just to be deceased <span class=\"ad-lib\">(Deceased)</span></p> <p>And it's almost curfew</p> <p>Watch your back for the super police</p> <p>Ever since the virus <span class=\"ad-lib\">(Uh)</span></p> <p>Ni kubaya in these streets <span class=\"ad-lib\">(In these streets)</span></p> <p>Down to my final shillings</p> <p>And I can't get no relief <span class=\"ad-lib\">(Nah)</span></p> <p>No space in the ICU</p> <p>Turned away just to be deceased <span class=\"ad-lib\">(Deceased)</span></p> <p>And it's almost curfew</p> <p>Watch your back for the super police</p></div><div class=\"section\"> <h2>Verse 2</h2> <p>Ahmed been fighting off jinns</p> <p>But his don't grow wings like Kazuya <span class=\"effect\">(Dorya!)</span></p> <p>Juu a young Muslim called Yassin</p> <p>Alibakishwa bila huruma</p> <p>Tired of all this shit</p> <p>Madawa anaanza kujidunga <span class=\"ad-lib\">(Uh)</span></p> <p>Moving to the dark side like Akuma</p> <p>Ken angemdungia waya sooner <span class=\"ad-lib\">(Damn)</span></p> <p>Lost his job</p> <p>Strings cut loose like a puppet <span class=\"ad-lib\">(Puppet)</span></p> <p>No money coming in</p> <p>So he got the tool and tucked it</p> <p>\"Fuck it, if I see an opp, I'll bust it</p> <p>Run the watch or you'll kick the bucket\" <span class=\"ad-lib\">(Grr, baow!)</span></p> <p>Sirens in the distance</p> <p>Someone sounded the trumpet</p> <p>Ahmed had no paper</p> <p>So he turned to Shang Tsung on road <span class=\"ad-lib\">(Road, road)</span></p> <p>Had to go from doing manual labour to taking souls <span class=\"ad-lib\">(Mm)</span></p> <p>It's mad, huu msee alikuwanga left back kali like Ashley Cole</p> <p>But the rona had him left back</p> <p>Now he's gonna rot in jail alone</p></div><div class=\"section\"> <h2>Chorus</h2> <p>Ever since the virus</p> <p>Ni kubaya in these streets <span class=\"ad-lib\">(Streets)</span></p> <p>Down to my final shillings</p> <p>And I can't get no relief <span class=\"ad-lib\">(Nah)</span></p> <p>No space in the ICU</p> <p>Turned away just to be deceased <span class=\"ad-lib\">(Deceased)</span></p> <p>And it's almost curfew</p> <p>Watch your back for the super police</p> <p>Ever since the virus <span class=\"ad-lib\">(Uh)</span></p> <p>Ni kubaya in these streets <span class=\"ad-lib\">(In these streets)</span></p> <p>Down to my final shillings</p> <p>And I can't get no relief <span class=\"ad-lib\">(Nah)</span></p> <p>No space in the ICU</p> <p>Turned away just to be deceased <span class=\"ad-lib\">(Deceased)</span></p> <p>And it's almost curfew</p> <p>Watch your back for the super police</p></div>",
            "credits": {
                "writers": ["Davy Kamanzi", "Luca Urbaniak"],
                "producers": ["waytoolost"],
                "arrangement": ["waytoolost", "Black Hole Records"],
                "mixMaster": ["Thee MC G'zay"],
                "recorded": [{
                    "studio": "Black Hole Records",
                    "city": "Nairobi, Kenya"
                }]
            }
        },
        {
            "id": "8",
            "title": "Grime or Drill? (Skit)",
            "runtime": "189",
            "style": ["Drill", "Comedy", "Skit"],
            "synopsis": "<p>This skit is based on an actual conversation I had with Amandeep Jagde (hilarious comedian) on the very same topic during an open mic with Punchline Comedy Club at Two Grapes in Hurlingham, which he references somewhere along the way. The song that prompted him to ask me the question that day was \"Nairobi Tofauti\", which DJ OCS always plays when I'm introduced to the stage (maybe that'll change with the release of this album).</p><p>I wrote a script for the skit sometime after the conversation and sent it to Aman. He liked it and we eventually laid it down in the studio, though he ad-libbed most of his lines to fit his own vocabulary and cadence, and even added some funny lines off the top of his head; if you pay attention, you can tell when he's reading and when he's just riffing, which I feel adds to the humour of the whole thing.</p><p>The skit initially wasn't accompanied by any music, but after a while I felt it would be difficult for casual listeners to get through, given that it was more than 3 minutes of plain dialogue. AndyBolo and I first started thinking about adding music after Aman suggested using elements of grime and drill at points when we reference them, but that didn't really go anywhere. At home, I started playing around with the stems for \"Simama Kando\" and \"Super Police\" (both 138 BPM), and suddenly the idea of combining the two for some laid-back background music started coming together.</p>",
            "lyrics": "<div class=\"section\"> <h2 class=\"skit\">Dialogue</h2> <p class=\"ad-lib\">Amandeep</p> <p>Cheki! If it isn't the man of substance himself.</p></div><div class=\"section\"> <p class=\"ad-lib\">DVK</p> <p>Ah, the sick Sikh! What are you doing in the studio, man?</p></div><div class=\"section\"> <p class=\"ad-lib\">Amandeep</p> <p>I was just delivering some jokes around the neighbourhood, my guy. I felt like I was misleading everyone because I'm a Muhindi.</p></div><div class=\"section\"> <p class=\"ad-lib\">DVK</p> <p>Wait, why?</p></div><div class=\"section\"> <p class=\"ad-lib\">Amandeep</p> <p>Look. You see, when they saw me, they thought I was gonna come here and give them some jobs. But it was too late for them to realise I'm here for some dick jokes, man. Who wants some- who wants some jokes, man?</p></div><div class=\"section\"> <p class=\"ad-lib\">DVK</p> <p>Bruh, those guys kinda sound like they suck, man.</p></div><div class=\"section\"> <p class=\"ad-lib\">Amandeep</p> <p>Yeah. Anyway, man, I've been hearing that song of yours, uh, at Two Grapes, you know? Every time we go there, I kill, and I hear you play that song, you know? And I remember: I have this one question for you, DVK.</p></div><div class=\"section\"> <p class=\"ad-lib\">DVK</p> <p>Which song?</p></div><div class=\"section\"> <p class=\"ad-lib\">Amandeep</p> <p>You know, the one about, uh, police brutality and all that, uh, nasty stuff.</p></div><div class=\"section\"> <p class=\"ad-lib\">DVK</p> <p>Ohh- oh, \"Super Police.\"</p></div><div class=\"section\"> <p class=\"ad-lib\">Amandeep</p> <p>Yeah, yeah, yeah, that one. That one. Uh, it's a dope song, by the way. As you have told me to say. I thought it was, uh, grime, but a friend of mine told me it was actually drill. Uh, I figured you would know the difference. So, what's the difference between, uh, grime and drill?</p></div><div class=\"section\"> <p class=\"ad-lib\">DVK</p> <p>The difference between grime and drill…</p></div><div class=\"section\"> <p class=\"ad-lib\">Amandeep</p> <p>Sorry, man. I'm, uh, I'm a bit stupid when it comes to such things. Uh, I don't know much else when it comes to this shit besides the musical stylings of Drake and Yo Yo Honey Singh.</p></div><div class=\"section\"> <p class=\"ad-lib\">DVK</p> <p>Nah, it's cool, man. Uh, it's kinda understandable 'cause drill and grime have similar tempos, but drill is generally, like, darker, or grittier than grime. Even when you pay attention to the drums, drill usually has, like, much harder-hitting drums and distinct drum patterns compared to, like, what you hear in a lot of, uh, grime music.</p></div><div class=\"section\"> <p class=\"ad-lib\">Amandeep</p> <p>Okay.</p></div><div class=\"section\"> <p class=\"ad-lib\">DVK</p> <p>Even when you look at their stylistic origins—you know, I'm educated. I have to use terms like that—uh, grime basically rose from, like, electronic music in the UK, like jungle and UK garage, whereas drill came from gangsta rap and, like, hardcore hip hop in Chicago.</p></div><div class=\"section\"> <p class=\"ad-lib\">Amandeep</p> <p>So basically, what you're trying to tell me, is grime is Babu Owino, and drill is Mike Sonko?</p></div><div class=\"section\"> <p class=\"ad-lib\">DVK</p> <p>Yeah, yeah. Like, uh, Babu Owino has a cleaner record than Sonko, but he's still crazy enough to shoot you in the neck, you know? Like, Sonko started out as a criminal, but now he's evolved and ventured into other things. Like, he's still a criminal at his core, you know? But now he's mixing it with politics and whatever else he's doing.</p></div><div class=\"section\"> <p class=\"ad-lib\">Amandeep</p> <p>Ohh. Ah, man, thanks. Thanks, bro, for the clarification, man.</p></div><div class=\"section\"> <p class=\"ad-lib\">DVK</p> <p>No worries, man. That was actually, like, a pretty good analogy you brought up.</p></div><div class=\"section\"> <p class=\"ad-lib\">Amandeep</p> <p>Aight. I'm gonna head back to the ends, as they say in the UK. I'll let you carry on with your ka-mixtape. Which, by the way, pretty hacky, you know? Every- every black guy has a mixtape. Even you, DVK? I thought you were different. I thought you were the chosen one.</p></div><div class=\"section\"> <p class=\"ad-lib\">DVK</p> <p>Bruh.</p></div><div class=\"section\"> <p class=\"ad-lib\">Amandeep</p> <p>But you're not. You're just like the others.</p></div><div class=\"section\"> <p class=\"ad-lib\">DVK</p> <p>Listen, man. A black guy without a mixtape is like a Kenyan influencer who's never had a job in radio at some point. Like, I have to represent my people, you know? Uh, anyway, uh, I'm actually going out with some friends after this, so in any case, I'll catch up with you later.</p></div><div class=\"section\"> <p class=\"ad-lib\">Amandeep</p> <p>Gang gang, brother.</p></div>",
            "credits": {
                "writers": ["Davy Kamanzi", "Luca Urbaniak", "Amandeep Jagde"],
                "featuring": ["Amandeep Jagde"],
                "producers": ["waytoolost"],
                "arrangement": ["DVK", "Black Hole Records"],
                "mixMaster": ["Black Hole Records"],
                "samples": [{
                        "title": "\"Simama Kando\"",
                        "info": "Song written by Davy Kamanzi and Luca Urbaniak, and performed by DVK for his studio album <em>Man of Substance</em>"
                    },
                    {
                        "title": "\"Super Police\"",
                        "info": "Song written by Davy Kamanzi and Luca Urbaniak, and performed by DVK for his studio album <em>Man of Substance</em>"
                    }
                ],
                "recorded": [{
                    "studio": "Black Hole Records",
                    "city": "Nairobi, Kenya"
                }]
            }
        },
        {
            "id": "9",
            "title": "Combi",
            "runtime": "215",
            "style": ["Boom bap"],
            "synopsis": "<p>This is one of five songs I wrote in December 2021 that weren't originally planned for this project. I found the beat on BeatStars while looking for a mellow boom bap beat to follow the skit with Aman, and seeing as I told him I'd be going out with some friends afterwards, coming up with ideas for this song was fairly easy.</p><p>In many ways, this song pays homage to St. Mary's School (Saints), which I attended for all 11 years of my primary and lower secondary education. The title references a combination of a doughnut or mandazi and a samosa that was by far the most popular snack among students during our mid-morning break time. BH later explained in the studio that the term also references certain traditional sexual practices in some Kenyan cultures, and Nigel alludes to mixing weed and alcohol in his verse, so make of the title what you will, I guess.</p><p>Given the Saints references, I felt it was only right that I feature fellow Saints alumni on the track, and that led me to Nigel and K-Spot, both of whom were in my year in primary school, left when I joined high school and I've occasionally kept in touch with since. Nigel ended up being the only one not to reference Saints in his verse outside of the song title, but I still really liked what he and Spot brought to the table. His intro is also where I got <em>Sippin' and Trippin'</em> from as the title for Part II of this album.</p><p>I wrote the outro at the end for BH to do as a segue into the next track, and I liked how he complimented the subdued nature of the beat at that point with his deep voice. His participation also made sense in that he also went to Saints; he was a year ahead of me in high school.</p>",
            "lyrics": "<div class=\"section\"> <h2>Intro</h2> <p>Ayy, it's 187 <span class=\"ad-lib\">(Ayy, woah)</span></p> <p class=\"ad-lib\">(Sippin' and trippin' and sippin' and trippin' and sippin' and trippin', you know?)</p> <p class=\"ad-lib\">(Ayy)</p></div><div class=\"section\"> <h2>Chorus</h2> <p>Tuna-chill, tukikula tu ma-combi</p> <p>Tuna-chill, tukikula tu ma-combi</p> <p>Tuna-chill, tukikula tu ma-combi</p> <p>Tuna-chill, tuki- yeah, ayy</p></div><div class=\"section\"> <h2>Verse 1</h2> <p>Tuna-chill, tukikula tu ma-combi</p> <p>Tunakula two chicks in a row type of combi</p> <p>Tuna-sip gin tuki-stone in the lobby</p> <p>Good combinations got me looking like a zombie</p> <p>Roll another doobie, go big or go home</p> <p>This is like a hobby, let me get in my zone</p> <p>Let me blow trees in the fuckin' ozone</p> <p>Lay up with your bitch if you look at me wrong</p> <p>Oh, I'm sorry, I'm actually a humble guy</p> <p>I'm just tryna get high, then somebody tried to lie</p> <p>So I had to light his ass like the Fourth of July</p> <p>Supply demand, demand supply</p> <p>That's what you need to get by</p> <p>That's what you need to stay high</p> <p>Combi ya tei na mamanzi, you might die</p> <p>But combi ya tei na mamanzi ndio inadai</p></div><div class=\"section\"> <h2>Chorus</h2> <p>Tuna-chill, tukikula tu ma-combi</p> <p>Tuna-chill, tukikula tu ma-combi</p> <p>Tuna-chill, tukikula tu ma-combi</p></div><div class=\"section\"> <h2>Verse 2</h2> <p>DVK back in the booth and you can tell your friends</p> <p>I was broke, niggas telling me to sell my dreads</p> <p>Hold up, why am I going into these bars again?</p> <p>All the ganja got me dancing with the stars again</p> <p>All my niggas wanakula tu ma-combi <span class=\"ad-lib\">(Wanakula tu ma-combi)</span></p> <p>Naskia FOMO lakini samosa ni forty <span class=\"ad-lib\">(Ai!)</span></p> <p>Mi si homo lakini bora nikule njoti <span class=\"ad-lib\">(Eh?)</span></p> <p>Yaani njugu, stop thinking of zile za Jordi</p> <p>El niño, making waves, mi Fernando <span class=\"ad-lib\">(Mi Fernando)</span></p> <p>On the stage, you already know I'm robbing ankles</p> <p>Leave you in the dust, up in the quadrangle <span class=\"ad-lib\">(Quadrangle)</span></p> <p>Baadaye I'm on the bus, biting on the mango</p> <p>On the field, ain't no fucking with the eclipse</p> <p>You're taking shots but I'm saving them like a flash disk</p> <p>Big forehead, big dreams za kuwa big fish</p> <p>Bonga biz nami, I'm just tryna get rich</p> <p>Hating in the comments, utakuwa dismissed</p></div><div class=\"section\"> <h2>Chorus</h2> <p>We just chillin' in the spot, eatin' combi</p> <p>We just chillin' in the spot, eatin' combi</p> <p>We just chillin' in the spot, eatin'</p> <p>Yeah, look <span class=\"ad-lib\">(It's K-Spot in this motherfucker, man)<span></p></div><div class=\"section\"> <h2>Verse 3</h2> <p>I don't feel alive, till I spark one, nigga</p> <p>On that Green House shit, we'll put a mark on a nigga</p> <p>I ain't never loved no hoe</p> <p>But Mary and Jane got me in my feels, straight from the heart, nigga</p> <p>I'm ballin' like I'm in my prime</p> <p>Pussy come with drama, nigga, I ain't got the time</p> <p>She tryna hit my line up and I hit decline</p> <p>'Cause a nigga busy gettin' high</p> <p>Yeah, yeah, yeah, look</p> <p>Take a chill pill, you should try do that</p> <p>I stay smokin' strong, you know it's that good gas</p> <p>You should slow it down sometime, no need to move fast</p> <p>Just sit back, relax, get gas, kick back while we</p> <p>Spit gas on wax and spazz on tracks</p> <p>Get on the map, we been like that</p> <p>No comin' back from what I got for ya</p> <p>It's exotic burnin'</p> <p>A little dose really finna knock your lungs over</p> <p>Spot</p></div><div class=\"section\"> <h2>Chorus</h2> <p>Tuna-chill, tukikula tu ma-combi</p> <p>Tuna-chill, tukikula tu ma-combi</p> <p>Tuna-chill, tukikula tu ma-combi</p> <p>Tuna-chill, tukikula tu ma-combi <span class=\"ad-lib\">(Ayy)</span></p></div><div class=\"section\"> <h2>Outro</h2> <p>Woah</p> <p>Sippin' and trippin' and sippin' and trippin' and sippin' and trippin', you know?</p> <p class=\"section-break\">Ayy</p> <p>Tunakula tu ma-combi, tuko hapa</p> <p class=\"section-break\">Na askari yuko pale ako jaba</p> <p>Sippin' and trippin' and sippin' and trippin' and sippin' and trippin', you know?</p> <p class=\"section-break\">Ayy</p> <p>Tunakula tu ma-combi, tuko hapa</p> <p>Na askari yuko pale ako jaba</p></div>",
            "credits": {
                "writers": ["Davy Kamanzi", "Malik Atterbury", "Fidel Nigel Owuor", "Kenneth Mbova Jr."],
                "featuring": ["Nigel 187", "K-Spot"],
                "producers": ["Passtense"],
                "arrangement": ["Passtense", "DVK", "Black Hole Records"],
                "additionalVocals": ["BH"],
                "mixMaster": ["Black Hole Records"],
                "recorded": [{
                        "studio": "Black Hole Records",
                        "city": "Nairobi, Kenya"
                    },
                    {
                        "studio": "K-Spot's bedroom",
                        "city": "Stockholm, Sweden"
                    }
                ]
            },
            "missingFrom": ["mixtape", "base"]
        },
        {
            "id": "10",
            "title": "Askari Ako Jaba",
            "runtime": "",
            "style": ["Kapuka rap", "Comedy rap"],
            "synopsis": "",
            "lyrics": "",
            "credits": {
                "writers": ["Davy Kamanzi", "Andrew Haines", "Brian Haines", "Solomon Ndung'u"],
                "featuring": ["JESHI", ["AndyBolo", "BH", "Oloso"]],
                "producers": ["Black Hole Records"],
                "arrangement": ["Black Hole Records", "DVK"],
                "mixMaster": ["Black Hole Records"],
                "recorded": [{
                    "studio": "Black Hole Records",
                    "city": "Nairobi, Kenya"
                }]
            }
        },
        {
            "id": "11",
            "title": "Wake Up",
            "runtime": "207",
            "style": ["Trap", "Shrap", "Comedy rap"],
            "synopsis": "<p>This is a fun song I wrote to a trap beat I found on BeatStars, and from the outset I knew I wanted Cap on it given the production style on the most popular songs he's produced, and the reputation he's built for himself in Nairobi's shrap/alt-rap scene; I also knew I wanted to bring in a rapper who could match my light-hearted lyrics and the trap flows I set out to bring. I initially considered Nigel 187 since he had done similar tracks in the past, but later I went with Lilmaina instead because I felt he would do a better job of what I was going for (and also, to be frank, because the guy had been popping off with hit after hit, regardless of how much more expensive bringing him in would be).</p><p>I reached out to both Cap and Lilmaina in September 2021, and both showed interest. Cap sent me some beats which I went through, before settling on one that I wanted him to modify because I didn't think it fully matched the vibe I wanted. That process took months, to the point where Lilmaina wondered whether I'd just abandoned the song (which would be strange because I had paid him already), but eventually Cap came through when I asked him to sample \"Nimesota\" from my debut EP. In the studio, I worked with AndyBolo to flesh out the beat with sounds similar to those from \"Nimesota\", and after some experimentation he landed on the final product with different instruments (like that beautiful French horn).</p><p>Lilmaina came to the studio having written some of his lines but wanted time to finish his sections in the first verse (aside from his first section, which I wrote for him), lay them down, then repeat for the second verse. Andy and I just used our phones while the beat looped and he did his thing, and we were really pleased with what he brought in the end. I'd already also written the outro for him but told him to do it in a way that felt natural to him, so that part was really easy.</p>",
            "lyrics": "<div class=\"section\"> <h2>Intro</h2> <p>The fuck is this nigga still doing asleep at 5 PM, man?</p> <p>Dude must've been sleeping in the morning this whole fucking week, man, Jesus</p> <p>Ebu hold on</p></div><div class=\"section\"> <h2>Hook</h2> <p>Wake up</p> <p>Wake up</p> <p>Wake up</p> <p>Wake up</p> <p>Wake up</p> <p>Wake up</p> <p>Wake up</p> <p>Wake up!</p></div><div class=\"section\"> <h2>Verse 1</h2> <p>Last night ilikuwa ngori, man</p> <p>Acha nikuambie story, man</p> <p>Tulikuwa na mzinga, ndani ya dinga</p> <p class=\"section-break\">Nyuma ya lorry, man</p> <p>Last night ilikuwa ngori, jo <span class=\"ad-lib\">(Jo)</span></p> <p>Gari iligusa 140, jo <span class=\"ad-lib\">(Ai)</span></p> <p>Na tulitoka kupewa, then tukalewa</p> <p class=\"section-break\">Mi sina worry, jo <span class=\"ad-lib\">(Ai, ai, ai)</span></p> <p>Last night ilikuwa ngori <span class=\"ad-lib\">(Mm)</span></p> <p>Makarao walitukang'a <span class=\"ad-lib\">(Ati?)</span></p> <p>Hongo tulianza kuchanga</p> <p class=\"section-break\">Buda, tulikuwa tu na soo saba, huh <span class=\"ad-lib\">(Wueh)</span></p> <p>Yeah, nikachanga soo nane <span class=\"ad-lib\">(Yeah)</span></p> <p>Toka kwa block, tano nane <span class=\"ad-lib\">(Mm)</span></p> <p>Huyo goon alitutoka, mwizi, mkora</p> <p class=\"section-break\">Si apatikane? <span class=\"ad-lib\">(Ai)</span></p> <p>Five-O pulled us over</p> <p>Tulikuwa lit na ilikuwa shida, huh <span class=\"ad-lib\">(Shida)</span></p> <p>Tulianza kutokwa jasho</p> <p>Ka tunacheza mpira, huh <span class=\"ad-lib\">(Wueh)</span></p> <p>Anza kuficha mzinga, utatukinda <span class=\"ad-lib\">(Yeah)</span></p> <p>Wacha ujinga, huh <span class=\"ad-lib\">(Wueh)</span></p> <p>Bangi hatujazima, huh</p> <p class=\"section-break\">Beast atatumaliza, huh</p> <p>Yeah, beast atatumaliza</p> <p>Wewe si wangu, acha ujinga, uh <span class=\"ad-lib\">(Ujinga)</span></p> <p>Pesa ndio lugha, my dear</p> <p>Ona ukikosa venye wataringa, uh <span class=\"ad-lib\">(Wueh, wueh)</span></p> <p>Avoid a lot of description</p> <p>Kama watataka, watakusikiza, uh</p> <p>Mike Posner, 2014</p> <p>Just took a pill in Ibiza, uh <span class=\"ad-lib\">(Wueh, wueh, wueh)</span></p></div><div class=\"section\"> <h2>Hook</h2> <p>Wake up <span class=\"ad-lib\">(Mm, yeah, uh)</span></p> <p>Wake up <span class=\"ad-lib\">(Wueh, wueh)</span></p> <p>Wake up <span class=\"ad-lib\">(Yeah, wueh)</span></p> <p>Wake up <span class=\"ad-lib\">(Yeah, wueh)</span></p> <p>Wake up <span class=\"ad-lib\">(Mm-hmm)</span></p> <p>Wake up <span class=\"ad-lib\">(Hmm-mm)</span></p> <p>Wake up <span class=\"ad-lib\">(Hmm-mm)</span></p> <p>Wake up!</p></div><div class=\"section\"> <h2>Verse 2</h2> <p>Yes, ni mimi <span class=\"ad-lib\">(Mm)</span></p> <p>Na nikibonga, please, fyata ulimi <span class=\"ad-lib\">(Fyata ulimi)</span></p> <p>Na buda si siri <span class=\"ad-lib\">(Uh)</span></p> <p>Why do you want me na we ni kafiri? <span class=\"ad-lib\">(Wueh)</span></p> <p>Kwani ni nini? <span class=\"ad-lib\">(Nini?)</span></p> <p>Ai, my bro, unawashwa na nini? <span class=\"ad-lib\">(Na nini?)</span></p> <p>Tulia ukae chini <span class=\"ad-lib\">(Mm)</span></p> <p class=\"section-break\">Ai, siamini una-burn hivi <span class=\"ad-lib\">(Mm, ai, wueh, heh!)</span></p> <p>Huh, hakuna choo</p> <p>And I need to pee <span class=\"ad-lib\">(I need to pee)</span></p> <p>Mi ni slay king, bro</p> <p>This life is not for me <span class=\"ad-lib\">(Aki walai)</span></p> <p>Msee amedenki kwa corner</p> <p>Ka ni pit latrine <span class=\"ad-lib\">(Ala!)</span></p> <p>Mwingine ananikodolea macho</p> <p class=\"section-break\">Ka ni Mr. Bean <span class=\"ad-lib\">(Mr. Bean)</span></p> <p>Mr. Right, I piga lean <span class=\"ad-lib\">(Piga lean)</span></p> <p>Tumeachana, what do you mean? <span class=\"ad-lib\">(Wueh, wueh)</span></p> <p>She was really the girl of my dreams</p> <p>Martin Luther, yes, I had a dream <span class=\"ad-lib\">(I had a dream)</span></p> <p>Zimeshika, jo, kuliko jana <span class=\"ad-lib\">(Wueh)</span></p> <p>Na kajaba ndio mimi nachana <span class=\"ad-lib\">(Jaba)</span></p> <p>Ni saa sita? Eh, ni mchana</p> <p class=\"section-break\">Twende home, bro, umeharibu sana <span class=\"ad-lib\">(Sana, uh, wueh)</span></p> <p>Huh, it's time to go</p> <p>I wanna leave this place <span class=\"ad-lib\">(I wanna leave)</span></p> <p>Rudisha doh, rudisha simu</p> <p>Nijikate please <span class=\"ad-lib\">(Rudisha simu)</span></p> <p>Huh, kufika home, jo</p> <p>What a disgrace <span class=\"ad-lib\">(Uh?)</span></p> <p>Askari alikuta mboch</p> <p>Akamwaga kwa plates</p></div><div class=\"section\"> <h2>Hook</h2> <p>Wake up</p> <p>Wake up</p> <p>Wake up</p> <p>Wake up</p> <p>Wake up</p> <p>Wake up</p> <p>Wake up</p></div><div class=\"section\"> <h2>Outro</h2> <p>Ah, huo karao amenipea manoti imbo</p> <p>Na sina kitu kwa M-Pesa, yaani</p> <p>Monday niko job na sina fare</p> <p>Na matha haezi nipea doh, shit</p> <p>Itabidi nimetafuta sponyo sasa</p> <p>Nipate nyama ingine ya kudishi hapa karibu nikirudi home</p> <p>Kuna time huu matha alidai nimkule, eh</p> <p class=\"section-break\">Ebu ngoja</p> <p class=\"effect section-break\">(phone ringing)</p> <p>Hello?</p> <p>Hello? Sema Mama Tevo</p> <p>Aki si umenitupa? Mambo?</p></div>",
            "credits": {
                "writers": ["Davy Kamanzi", "Michael Chepkwony", "Andrew Haines", "Jeremy Maina"],
                "featuring": ["Lilmaina"],
                "producers": ["Cap", "Black Hole Records"],
                "arrangement": ["Cap", "DVK", "Black Hole Records"],
                "mixMaster": ["Thee MC G'zay"],
                "samples": [{
                    "title": "\"Nimesota\"",
                    "info": "Song written by Davy Kamanzi, Andrew Haines, and Brian Haines, and performed by DVK and JESHI for DVK's extended play <em>Not a Rapper</em>"
                }],
                "recorded": [{
                    "studio": "Black Hole Records",
                    "city": "Nairobi, Kenya"
                }]
            }
        },
        {
            "id": "12",
            "title": "Tafuta Sponyo",
            "runtime": "216",
            "style": ["Afro rap", "Afropop", "Comedy rap"],
            "synopsis": "<p>This is the very first song I wrote for this project. I actually did it while writing <em>Not a Rapper</em> in the middle of 2020 and previewed it on my Instagram in November that year, but decided to leave it off the EP because I had bigger plans for it. I always felt it could be a hit if I took my time with it, since it's a song I felt many Kenyans could relate to and enjoy.</p><p>I found the beat in a random ad while browsing drill beats on BeatStars during the writing process for <em>Not a Rapper</em>, and while I'd worked with Black Hole to create new beats for the rest of the songs I wrote, I didn't want to change anything with this one because I loved the beat too much. It also just didn't fit, and I was too broke to buy the beat at the time.</p><p>To this day I'll never understand how the premise for the song and its lyrics came to mind; I simply caught a vibe while listening to the beat and this is what came out. It also served as the foundation to build out the entire story for <em>Sippin' and Trippin'</em>, so it's a bit crazy to think that a whole six tracks may never have existed had I never wrote this song.</p><p>AndyBolo's writing credit may come as a surprise given that he doesn't appear anywhere, but he's the one that had me switch things up in the first and second chorus with the \"baby girl\" and \"buda boss\" lines, respectively. He brought it up while we were recording the song and I feel like it added a little extra spice to my flow, so I decided to give him the credit.</p>",
            "lyrics": "<div class=\"section\"> <h2>Intro</h2> <p>DVK</p> <p>Cheki, times are tough, man</p> <p>Sometimes you have to use your bodily assets to</p> <p>Get the bag, you know what I'm saying?</p> <p>Ayy</p></div><div class=\"section\"> <h2>Verse 1</h2> <p>Najua karembo kanasomea UON</p> <p>Anapenda kuji-nice, frolicking with all her friends</p> <p>Shepu yake ajabu, huwezi comprehend</p> <p>Kila boy anamdai, wish they had her in their bed</p> <p>But they ain't getting no bread and she's tryna be a boss</p> <p>Tryna get some likes on the 'Gram with all the filters</p> <p>Kama huna class, anapendanga ku-floss</p> <p>Ye mwenyewe anamumunya njugu kwake bedsitter</p> <p>Unadai ku-party Naks, kejani kunaboo</p> <p>Lakini mabeshte jo, they won't pick up the phone</p> <p>Unataka kwenda salon juu nywele ime-beat</p> <p>Lakini mfuko, jo, pesa usha-delete, ayy</p> <p>Sasa unatembea loso</p> <p>Ukasalimiwa nje ya club</p> <p>Mzae amekuroga na ngoso</p> <p>Baby get your money up</p></div><div class=\"section\"> <h2>Chorus 1</h2> <p>Uko nyumbani na bado unasaka form?</p> <p class=\"ad-lib\">(Ayy, baby tafuta sponyo)</p> <p>Umeboeka na unadai kuwasha ndom?</p> <p class=\"ad-lib\">(Ayy, baby tafuta sponyo)</p> <p>Unadai Konyagi lakini umekosa job?</p> <p class=\"ad-lib\">(Ai, baby tafuta sponyo)</p> <p>Unakufa njaa na mandazi ya 20 bob?</p> <p class=\"ad-lib\">(Ayy, baby girl tafuta sponyo, ayy)</p></div><div class=\"section\"> <h2>Verse 2</h2> <p>Najua kasee kanasomea hapo Strath</p> <p>Piga toja na kabuti kila siku, looking dapper</p> <p>Madem wanamwona ye ni tall, dark and handsome</p> <p>Each of them dreaming to be loved by such a man</p> <p>Wanamsho, \"What's the plan? I wanna go out on a date\"</p> <p>Hana pesa ya ku-burn, watauma vako</p> <p>Focus yake kwanza ni putting food on his plate</p> <p>Buda anasunda keki kwa jiko ya charcoal</p> <p>Unadai ku-buy njumu za Nike juu ni moto</p> <p>Lakini unasaka pesa ukicheza lotto</p> <p>Unadai kupiga watu Tekken hapo Tric</p> <p>Lakini ulichoma pesa ukipiga liqs, ayy</p> <p>Sasa una-chill nje ya bar</p> <p>Then you see her pull up with the car</p> <p>Matha anasaka boy kunyandua</p> <p>Nigga, take your cheque ukimaliza kurarua</p></div><div class=\"section\"> <h2>Chorus 2</h2> <p>Boys wako na rieng but hudai kupanda matatu?</p> <p class=\"ad-lib\">(Heh, buda tafuta sponyo)</p> <p>Unatafutiwa deni na ule boy Kimatu?</p> <p class=\"ad-lib\">(Wueh, buda tafuta sponyo)</p> <p>Tokens zimeisha, ulikuwa unacheza FIFA?</p> <p class=\"ad-lib\">(Ayayayayayaya, buda tafuta sponyo)</p> <p>Una ubao but umechoka kula njiva?</p> <p class=\"ad-lib\">(Eh, buda boss tafuta sponyo)</p></div><div class=\"section\"> <h2>Bridge</h2> <p>Unadai ku-party Naks, kejani kunaboo</p> <p class=\"ad-lib\">(Sasa unatembea loso)</p> <p>Lakini mabeshte jo, they won't pick up the phone</p> <p class=\"ad-lib\">(Mzae amekuroga na ngoso)</p> <p>Sasa una-chill nje ya bar</p> <p class=\"ad-lib\">(Ukasalimiwa nje ya club)</p> <p>Then you see her pull up with the car</p> <p class=\"ad-lib\">(Nigga, get your money up)</p> <p>Unadai ku-party Naks, kejani kunaboo</p> <p class=\"ad-lib\">(Sasa unatembea loso)</p> <p>Lakini mabeshte jo, they won't pick up the phone</p> <p class=\"ad-lib\">(Mzae amekuroga na ngoso)</p> <p>Sasa una-chill nje ya bar</p> <p class=\"ad-lib\">(Ukasalimiwa nje ya club)</p> <p>Then you see her pull up with the car</p> <p class=\"ad-lib\">(Nigga, get your money up)</p></div><div class=\"section\"> <h2>Chorus 3</h2> <p>Umeleta wageni home lakini huna ugali?</p> <p class=\"ad-lib\">(Eh, buda tafuta sponyo)</p> <p>Unasaka nginyo na huna maji nyumbani?</p> <p class=\"ad-lib\">(Hmm, baby tafuta sponyo)</p> <p>Ati ile tenje mpya unadai ni thao tisa?</p> <p class=\"ad-lib\">(Wueh, buda tafuta sponyo)</p> <p>Ati nywele ni thao saba na hutaki kulipa?</p> <p class=\"ad-lib\">(Ah, baby tafuta sponyo)</p> <p>Lover toka ng'ambo, madam ametoka Moshi</p> <p class=\"ad-lib\">(Eish, buda tafuta sponyo)</p> <p>Tess amekuleta club na we ndio ulipe bill?</p> <p class=\"ad-lib\">(Ai, baby tafuta sponyo)</p> <p>Aunty wa Harrier anakudai shuma ya doshi</p> <p class=\"ad-lib\">(Ii, buda tafuta sponyo)</p> <p>Otis apige miti, bora tu uko na pill</p> <p class=\"ad-lib\">(Ayy, baby tafuta sponyoooo)</p></div>",
            "credits": {
                "writers": ["Davy Kamanzi", "Suksan Salarak", "Andrew Haines"],
                "producers": ["Thaibeats"],
                "arrangement": ["Thaibeats"],
                "mixMaster": ["Black Hole Records"],
                "recorded": [{
                    "studio": "Black Hole Records",
                    "city": "Nairobi, Kenya"
                }]
            }
        },
        {
            "id": "13",
            "title": "Withdrawal Symptoms",
            "runtime": "209",
            "style": ["Trap", "Shrap", "Comedy rap"],
            "synopsis": "<p>This is one of five songs I wrote in December 2021 that weren't originally planned for this project. Its premise was initially meant for a potential stand-up bit, but since I felt it would fit nicely within the story of <em>Sippin' and Trippin'</em>, I decided to turn it into a song instead.</p><p>At the time of writing the song, I had listened to Cap's recently released debut album <em>All Caps</em> about three times, so I was in a space where I wanted to tap into his production style for this song as well as \"Wake Up\". I browsed through the beats he had sent me again and settled on one, but when I asked him for the stems, he told me the beat was already taken. That drove me to explore some of his collaborators at East Side Nation (ESN), eventually settling on Jami after finding three beats on his Instagram that I really liked.</p><p>I reached out to Jami in December 2021, and he eventually responded early the following month; he said that he didn't have the stems for any of the three beats because he'd had some serious issues with his laptop. When I settled on the beat I wanted, he recreated it, sent it to me and it turned out much better than the original. Moral of the story: Sometimes setbacks give you the opportunity to do something even better than before.</p><p>Around the same time I found Jami's beats, I was also thinking about getting a woman to tell in her own words what goes through her mind when she's in her ovulation period and feeling hornier than usual. I had recently discovered Groovy Jo's music and liked the \"bad bitch\" energy she brought on her song \"Big Ole Big Booty\", so I decided to look no further and reach out. I was really impressed with what she came up with and her decision to respond to my verse, rather than simply retelling it from her perspective (or rather the perspective of the older woman Lilmaina calls at the end of \"Wake Up\", which is what I initially envisioned).</p><p>The idea for the sample at the end came on the morning of my last studio session for the album and getting Ty's blessing was easy, having gotten to know him through stand-up.</p>",
            "lyrics": "<div class=\"section\"> <h2>Chorus</h2> <p>You came for the stick</p> <p>Nikasema, \"No\"</p> <p>Ukaanza ku-trip</p> <p>Hadi nikasema, \"Woah\"</p> <p>If you keep this up then baby</p> <p>I might have to go</p> <p>If you keep this up then maybe</p> <p>I might have to roll</p> <p>You came for the stick</p> <p>Nikasema, \"No\"</p> <p>Ukaanza ku-trip</p> <p>Hadi nikasema, \"Woah\"</p> <p>If you keep this up then baby</p> <p>I might have to go</p> <p>If you keep this up then maybe</p> <p>I might have to roll <span class=\"ad-lib\">(Jami dropping dimes)</span></p></div><div class=\"section\"> <h2>Verse 1</h2> <p>Dem alifika kwangu</p> <p>Alijipea invitation <span class=\"ad-lib\">(Alijipea invitation)</span></p> <p>Alidai kunikula ka mango</p> <p>Kutoa stress ya occupation <span class=\"ad-lib\">(Ayy)</span></p> <p>Akadai ati, <span class=\"ad-lib\">\"Stick ni yangu!\"<span></p> <p>Caught off guard by the irritation <span class=\"ad-lib\">(Wueh!)</span></p> <p>Kumbe ni withdrawal symptoms during ovulation</p> <p>Came at me, no hesitation <span class=\"ad-lib\">(No hesitation)</span></p> <p>Had to tell her calm down</p> <p>I know that you're stressed</p> <p>And I know that you wanna lie down</p> <p>Know you might be vexed</p> <p>But I don't really wanna right now</p> <p>I just had some eggs</p> <p>And I'm too full to lay the pipe down</p> <p>Also had some bread</p> <p>Lakini naishuku though <span class=\"ad-lib\">(Why?)</span></p> <p>Tumbo ikadensi, maze</p> <p>Nikaenda choo <span class=\"ad-lib\">(Ahh)</span></p> <p>Venye mi nadenki</p> <p>Naeza panda mbegu, bro <span class=\"ad-lib\">(Ehen)</span></p> <p>Finished the deposit</p> <p>Nikarudi kumaliza episode</p> <p>Hours later, hit the shower with my baby</p> <p>Body looking like a snack</p> <p>No, a meal, she's a keeper</p> <p>And I'ma have to attack</p> <p>Water drippin'</p> <p>And she creepin' up on me, shaking her ass</p> <p>\"Fuck! Okay, yeah, I'll smash\"</p></div><div class=\"section\"> <h2>Chorus</h2> <p>You came for the stick</p> <p>Nikasema, \"No\" <span class=\"ad-lib\">(No)</span></p> <p>Ukaanza ku-trip</p> <p>Hadi nikasema, \"Woah\" <span class=\"ad-lib\">(Nikasema, \"Woah\")</span></p> <p>If you keep this up then baby</p> <p>I might have to go</p> <p>If you keep this up then maybe</p> <p>I might have to roll <span class=\"ad-lib\">(Roll, roll, roll)</span></p> <p>You came for the stick</p> <p>Nikasema, \"No\" <span class=\"ad-lib\">(Nah)</span></p> <p>Ukaanza ku-trip</p> <p>Hadi nikasema, \"Woah\" <span class=\"ad-lib\">(Damn, baby)</span></p> <p>If you keep this up then baby <span class=\"ad-lib\">(Groovy Jo)</span></p> <p>I might have to go <span class=\"ad-lib\">(I might have to go)</span></p> <p>If you keep this up then maybe <span class=\"ad-lib\">(Yeah)</span></p> <p>I might have to roll</p></div><div class=\"section\"> <h2>Verse 2</h2> <p>You ain't gotta trip</p> <p>I got my gas so I'ma go <span class=\"ad-lib\">(Gas so I'ma go)</span></p> <p>Don't need no inches</p> <p>Got twenty-two, this not a fro <span class=\"ad-lib\">(This not a fro)</span></p> <p>Got a sneaky link</p> <p>I'll shoot a text and we gon' roll <span class=\"ad-lib\">(Roll)</span></p> <p>Niggas come and go <span class=\"ad-lib\">(Go)</span></p> <p>Dick always available <span class=\"ad-lib\">('ble)</span></p> <p>Big ol' big booty</p> <p>Say my name, it's honourable <span class=\"ad-lib\">(It's honourable)</span></p> <p>I'm lookin' sweet, I'm lookin' nice</p> <p>You got yourself an edible <span class=\"ad-lib\">(Yeah)</span></p> <p>So how you not gon' hit?</p> <p>How you ain't losin' out control?</p> <p>I'ma flip the switch</p> <p>And we gon' see who'll beg for sure <span class=\"ad-lib\">(Yo)</span></p> <p>Cold, I got a coat <span class=\"ad-lib\">(Coat)</span></p> <p>Drippin', need a boat <span class=\"ad-lib\">(Boat)</span></p> <p>Like Bey T, do the most <span class=\"ad-lib\">(Most)</span></p> <p>Do this unprovoked <span class=\"ad-lib\">(Woah)</span></p> <p>See me, he gon' choke</p> <p>I got a body, call Twelve-O</p> <p>Work of art, it needs a show</p> <p>Send a picture, he like, \"Woah <span class=\"ad-lib\">(Woah)</span></p> <p>Woah <span class=\"ad-lib\">(woah)</span>, woah\"</p> <p>Back it up, I got a folder</p> <p>Stuck on you like poster</p> <p>So you gon' have to take this</p> <p>Like a real nigga supposed to <span class=\"ad-lib\">(Yeah)</span></p> <p>Kick it with no loafers</p> <p>Bedroom to the sofa</p> <p>No talk, this not Oprah <span class=\"ad-lib\">(Yeah)</span></p></div><div class=\"section\"> <h2>Chorus</h2> <p>You came for the stick</p> <p>Nikasema, \"No\" <span class=\"ad-lib\">(No)</span></p> <p>Ukaanza ku-trip</p> <p>Hadi nikasema, \"Woah\" <span class=\"ad-lib\">(Nikasema, \"Woah\")</span></p> <p>If you keep this up then baby</p> <p>I might have to go</p> <p>If you keep this up then maybe</p> <p>I might have to roll <span class=\"ad-lib\">(Roll, roll, roll)</span></p> <p>You came for the stick</p> <p>Nikasema, \"No\" <span class=\"ad-lib\">(Nah)</span></p> <p>Ukaanza ku-trip</p> <p>Hadi nikasema, \"Woah\" <span class=\"ad-lib\">(Damn, baby)</span></p> <p>If you keep this up then baby</p> <p>I might have to go <span class=\"ad-lib\">(I might have to go)</span></p> <p>If you keep this up then maybe</p> <p>I might have to roll</p></div><div class=\"section\"> <h2>Outro</h2> <p>\"Oh, that was your girl, eh?</p> <p>I gave her the dick\" <span class=\"effect\">(laughter)</span></p> <p>Like, bro, you won! <span class=\"effect\">(laughter)</span></p> <p>I can't compete with that \"dick\" <span class=\"effect\">(laughter)</span></p></div>",
            "credits": {
                "writers": ["Davy Kamanzi", "James Mutunga", "Joan Nyabaro"],
                "featuring": ["Groovy Jo"],
                "producers": ["Jami"],
                "arrangement": ["Jami", "DVK", "Black Hole Records"],
                "mixMaster": ["Thee MC G'zay"],
                "samples": [{
                    "title": "\"The Ugandan accent\"",
                    "info": "Video published by Ty Ngachira for his Instagram account (@anto_ty) on 22 April 2021"
                }],
                "recorded": [{
                        "studio": "Black Hole Records",
                        "city": "Nairobi, Kenya"
                    },
                    {
                        "studio": "Pops Muzik",
                        "city": "Nairobi, Kenya"
                    }
                ]
            },
            "missingFrom": ["mixtape", "base"]
        },
        {
            "id": "14",
            "title": "STD",
            "runtime": "174",
            "style": ["Drill", "Benga", "Rhumba", "Comedy rap"],
            "synopsis": "<p>In my opinion, this is definitely the silliest, most light-hearted song on this album, and makes for a really fun note to end it on. While I'd only ever thought about the song in terms of how it ends the story of <em>Sippin' and Trippin'</em>, AndyBolo pointed out in the studio that he also sees it as a fun way of highlighting real sexual health struggles and situations that many young Kenyans go through and can relate to. It's only fitting then that he was the one who came up with the warning in the chorus that he recorded himself: \"Ogopa STD!\"</p><p>I wrote this song to a Congolese-style afro drill beat I found on BeatStars, and that gave me the idea of having G'zay work on a benga/rhumba drill beat, which he really liked when I first pitched it to him. For the guitar sample, I first reached out to a guitarist I found on YouTube called Blessed Ben, but things didn't quite pan out with him. I later reached out to a producer called Ben Theuri, who I'd been following on Instagram for a little while, and while (in his own words) he had never worked on anything benga/rhumba before, he took some time to do his research, and eventually hit an absolute home run with the sample. With the new beat and its different feel, I had to make some adjustments to the lyrics and rewrite the outro, but most of the lyrics remained the same.</p><p>While I was plotting on featuring Lilmaina on \"Wake Up\", I also thought about having him use the silly voice he does on some of his videos for some ad-libs I'd already recorded, which I felt would add to the light-heartedness of the song. He did his thing brilliantly once we were done with \"Wake Up\" and I'm really happy with how it turned out in the end.</p>",
            "lyrics": "<div class=\"section\"> <h2>Verse 1</h2> <p>Christopher</p> <p>Christopher got herpes from Cassandra</p> <p class=\"ad-lib\">(Na hana pesa ya treatment)</p> <p>Job ni kufagia nywele kwa barber</p> <p>Msee ako njaa, lunch ye hudishi mahaga</p> <p>They call his dick the cable <span class=\"ad-lib\">(Mm?)</span></p> <p>Inatoa stima ka charger</p> <p class=\"ad-lib\">(Cassandra ni Mama Tevo, by the way) </p> <p>Jana alikuwa na ka-vlogger <span class=\"ad-lib\">(Ayy)</span></p> <p>Last week alipea mama mboga <span class=\"ad-lib\">(Uh?)</span></p> <p>Neiba akasaka bakora <span class=\"ad-lib\">(Ehen)</span></p> <p>For the cake he was willing to risk</p> <p>Akaenda kumpiga miti <span class=\"ad-lib\">(Miti)</span></p> <p>Kumbe shimo imejaa weeds</p> <p>Ikamwasha ka kiberiti</p></div><div class=\"section\"> <h2>Pre-Chorus 1</h2> <p>Piga kachapo na chai <span class=\"ad-lib\">(Chai)</span></p> <p>Halafu useti ngwai <span class=\"ad-lib\">(Shash)</span></p> <p>Maisha ngori walai <span class=\"ad-lib\">(Walai)</span></p> <p>Lakini bora uhai <span class=\"ad-lib\">(Ehen)</span></p> <p>Piga kachapo na chai <span class=\"ad-lib\">(Chai)</span></p> <p>Halafu useti ngwai <span class=\"ad-lib\">(Shash)</span></p> <p>Sema tu bora uhai</p></div><div class=\"section\"> <h2>Chorus</h2> <p>Timo hawezi nyora, ako hosi juu</p> <p>Kuni uliichoma last week</p> <p>I will never, ever, ever do you, baby <span class=\"ad-lib\">(I will never, ever, ever do you, baby)</span></p> <p>Singependa kuambukiza nugu, baby <span class=\"ad-lib\">(Singependa kuambukiza nugu, baby)</span></p> <p>Ushaicheki Brayo akitembea?</p> <p>Always feeling itchy down there</p> <p>Wouldn't wanna catch a pimple, would you, baby <span class=\"ad-lib\">(Wouldn't wanna catch a pimple, would you, baby?)</span></p> <p>Kama rungu inakaa mabuyu, baby? <span class=\"ad-lib\">(Ogopa STD!)</span></p></div><div class=\"section\"> <h2>Verse 2</h2> <p class=\"ad-lib\">(What about Mary?)</p> <p>Mary alipewa crabs na bae</p> <p>Aliingia kwa shower</p> <p>She did not know what to say</p> <p>Maze, jana boyfie</p> <p>Alikuwa amemletea bouquet <span class=\"ad-lib\">(Akamletea bouquet)</span></p> <p>Wakaingia kitanda</p> <p>To celebrate her birthday <span class=\"ad-lib\">(Ayayayayayayayaya)</span></p> <p><span class=\"ad-lib\">(Wueh!)</span> Crabs zilikuwa zimemwuma <span class=\"ad-lib\">(Eh!)</span></p> <p>Akaanza kujikuna <span class=\"ad-lib\">(Ah?)</span></p> <p>Ointment kwa hao hakuna <span class=\"ad-lib\">(Ala!)</span></p> <p>Akapiga simu kwa doctor</p> <p>But akasema, \"Niko busy\" <span class=\"ad-lib\">(Niko busy)</span></p> <p>Ngem imemalizwa na mister</p> <p>Aki huu dem atachizi</p></div><div class=\"section\"> <h2>Pre-Chorus 2</h2> <p>Piga kachapo mayai <span class=\"ad-lib\">(Mayai)</span></p> <p>Halafu useti chai <span class=\"ad-lib\">(Hana ngwai)</span></p> <p>Maisha ngori walai <span class=\"ad-lib\">(Walai)</span></p> <p>Lakini bora uhai <span class=\"ad-lib\">(Ehen)</span></p> <p>Piga kachapo mayai <span class=\"ad-lib\">(Mayai)</span></p> <p>Halafu useti chai <span class=\"ad-lib\">(Hana ngwai)</span></p> <p>Sema tu bora uhai</p></div><div class=\"section\"> <h2>Chorus</h2> <p>Timo hawezi nyora, ako hosi juu</p> <p>Kuni uliichoma last week</p> <p>I will never, ever, ever do you, baby <span class=\"ad-lib\">(I will never, ever, ever do you, baby)</span></p> <p>Singependa kuambukiza nugu, baby <span class=\"ad-lib\">(Singependa kuambukiza nugu, baby)</span></p> <p>Ushaicheki Brayo akitembea?</p> <p>Always feeling itchy down there</p> <p>Wouldn't wanna catch a pimple, would you, baby <span class=\"ad-lib\">(Wouldn't wanna catch a pimple, would you, baby?)</span></p> <p>Kama rungu inakaa mabuyu, baby? <span class=\"ad-lib\">(Ogopa STD!)</span></p></div><div class=\"section\"> <h2>Outro</h2> <p>You came for the stick</p> <p>Nikasema, \"No\"</p> <p>Then uka-insist</p> <p>Nikasema, \"Sawa\" <span class=\"ad-lib\">(Sawa!)</span></p> <p>I gave you this dick</p> <p>Saa hii napewa dawa</p> <p>And that's that</p> <p>Man of Substance</p></div>",
            "credits": {
                "writers": ["Davy Kamanzi", "Daryl Kimani", "Benson Theuri", "Andrew Haines"],
                "producers": ["Thee MC G'zay"],
                "arrangement": ["Thee MC G'zay", "DVK"],
                "guitar": ["Ben Theuri"],
                "additionalVocals": ["Lilmaina", "AndyBolo"],
                "mixMaster": ["Thee MC G'zay"],
                "interpolates": [{
                    "title": "\"Withdrawal Symptoms\"",
                    "info": "Song written by Davy Kamanzi, James Mutunga, and Joan Nyabaro, and performed by DVK and Groovy Jo for DVK's studio album <em>Man of Substance</em>"
                }],
                "recorded": [{
                    "studio": "Black Hole Records",
                    "city": "Nairobi, Kenya"
                }]
            }
        },
        {
            "id": "15",
            "title": "Nairobi Tofauti (Remix)",
            "runtime": "140",
            "style": ["Drill", "Conscious rap"],
            "synopsis": "<p>This is one of the first songs I wrote for <em>Not a Rapper</em>, which I then previewed on my Twitch stream sometime in the middle of 2020. Black Hole had created a new beat for it as they'd done with the rest of the songs on that project, but after dropping it, I always felt a desire to re-release it with the beat I wrote it to. I'd been browsing through drill beats on YouTube when I landed on this absolute banger that Saint Cardona had made.</p><p>As a kid from a middle-class background, I felt I wouldn't be able to do the song and its subject matter justice by myself, so I started thinking about who I could bring in for a more \"ghetto\" perspective. My initial target was Smady Tings, who I've always considered the most lyrically adept member of Mbogi Genje, but at the time the fee their manager was demanding was too much for me.</p><p>After thinking through my options further, I realised I didn't even have to go that far when an old rapper friend of my brother's was around, so pretty much as soon as that occurred to me, I reached out to Vktor Mirage (who went by GuyMoja at the time). I was very familiar with his ability to tell stories from the hood in his music, and although I'd never heard him rhyme on a drill beat at that point, I never doubted his ability to deliver.</p>",
            "lyrics": "<div class=\"section\"> <h2>Intro</h2> <p>Yo, DVK</p> <p>Piga toja na kabuti</p> <p>Ehen</p> <p>Yo, check</p></div><div class=\"section\"> <h2>Chorus</h2> <p>Bonga biz na ma-big fish <span class=\"ad-lib\">(Mm-hmm)</span></p> <p>Piga toja na kabuti <span class=\"ad-lib\">(Ayy)</span></p> <p>Runda <span class=\"ad-lib\">(ayy)</span>, Easich <span class=\"ad-lib\">(Ayy)</span></p> <p>Ni Nairobi tofauti <span class=\"ad-lib\">(Ehen)</span></p> <p>Sonko ama sufferer</p> <p>Renga Umo, ni mauti <span class=\"ad-lib\">(My fren)</span></p> <p>Karen <span class=\"ad-lib\">(ayy)</span>, Kibich <span class=\"ad-lib\">(Ayy)</span></p> <p>Ni Nairobi tofauti <span class=\"ad-lib\">(Ayy)</span></p> <p>Bonga biz na ma-big fish <span class=\"ad-lib\">(Mm-hmm)</span></p> <p>Piga toja na kabuti <span class=\"ad-lib\">(Ayy)</span></p> <p>Runda <span class=\"ad-lib\">(ayy)</span>, Easich <span class=\"ad-lib\">(Ayy)</span></p> <p>Ni Nairobi tofauti <span class=\"ad-lib\">(Ehen)</span></p> <p>Sonko ama sufferer</p> <p>Renga Umo, ni mauti <span class=\"ad-lib\">(My fren)</span></p> <p>Karen <span class=\"ad-lib\">(ayy)</span>, Kibich <span class=\"ad-lib\">(Ayy)</span></p> <p>Ni Nairobi tofauti</p></div><div class=\"section\"> <h2>Verse 1</h2> <p>Morio tembea siku fulani</p> <p>Hapo kando Kilimani <span class=\"ad-lib\">(Ayy)</span></p> <p>With the lights and all the honeys <span class=\"ad-lib\">(Ayy)</span></p> <p>Where the niggas getting money <span class=\"ad-lib\">(Ehen)</span></p> <p>Majambazi inadi</p> <p>Leta nangos ama baki <span class=\"ad-lib\">(My fren)</span></p> <p>Sanse <span class=\"ad-lib\">(ayy)</span>, kamata <span class=\"ad-lib\">(Ayy)</span></p> <p>Nenda wakalale ndani</p> <p>Justice for Samuel bana</p> <p>Kesi bado ati ikuwe resolved? <span class=\"ad-lib\">(Resolved?)</span></p> <p>Babu aligeuza buda mboga</p> <p>Sasa hawezi evolve?</p> <p>Slay king kama mimi <span class=\"ad-lib\">(Ayy)</span></p> <p>Mbona kanyaga Umo? <span class=\"ad-lib\">(Ero!)</span></p> <p>Juu ukipatana na mbogi <span class=\"ad-lib\">(Eh-eh, eh-eh)</span></p> <p>Jua ni the end of the road</p></div><div class=\"section\"> <h2>Verse 2</h2> <p>Nairobi Half Life</p> <p>Oti alishandwa ridhee</p> <p>Kam slum</p> <p>Tuna-feed watoi na mboga za kindee</p> <p>Iwe ndengu au bundee</p> <p>Na-deliver hivi pundee</p> <p>Mambo ni tofauti na tuko ruti</p> <p>Saunya ndio buti</p> <p>Toja heavy kwenye waist</p> <p>Ndio maana navaa kabuti</p> <p>Mtaani different these days</p> <p>Nahepesha Isuzu, Maruti</p> <p>Vidole pete njiriva</p> <p>Davy paisha dinga</p> <p>Makabollo ni young achiever</p> <p>Naotea goro na akiba</p> <p>Umo 2, MojaMoja!</p></div><div class=\"section\"> <h2>Chorus</h2> <p>Bonga biz na ma-big fish <span class=\"ad-lib\">(Mm-hmm)</span></p> <p>Piga toja na kabuti <span class=\"ad-lib\">(Ayy)</span></p> <p>Runda <span class=\"ad-lib\">(ayy)</span>, Easich <span class=\"ad-lib\">(Ayy)</span></p> <p>Ni Nairobi tofauti <span class=\"ad-lib\">(Ehen)</span></p> <p>Sonko ama sufferer</p> <p>Renga Umo, ni mauti <span class=\"ad-lib\">(My fren)</span></p> <p>Karen <span class=\"ad-lib\">(ayy)</span>, Kibich <span class=\"ad-lib\">(Ayy)</span></p> <p>Ni Nairobi tofauti</p></div><div class=\"section\"> <h2>Outro</h2> <p>Bonga biz na ma-big fish</p> <p>Piga toja na kabuti</p> <p>Runda, Easich</p> <p>Ni Nairobi tofauti <span class=\"ad-lib\">(Ehen)</span></p> <p>Sonko ama sufferer</p> <p>Renga Umo, ni mauti <span class=\"ad-lib\">(My fren)</span></p> <p>Karen, Kibich</p> <p>Ni Nairobi tofauti</p></div>",
            "credits": {
                "writers": ["Davy Kamanzi", "Jhonny Leandro Sandoval Cardona", "Stephen Otieno Mak"],
                "featuring": ["Vktor Mirage"],
                "producers": ["Saint Cardona"],
                "arrangement": ["Saint Cardona", "Black Hole Records"],
                "mixMaster": ["Black Hole Records"],
                "recorded": [{
                    "studio": "Black Hole Records",
                    "city": "Nairobi, Kenya"
                }]
            },
            "missingFrom": ["expanded", "base"]
        },
        {
            "id": "16",
            "title": "Slay King Remake (Vitu Sipendi)",
            "runtime": "165",
            "style": ["Drill", "Comedy rap"],
            "synopsis": "<p>Between this song and \"Nairobi Tofauti\", I've never been able to decide which one is my favourite from <em>Not a Rapper</em>. I really like this song as well because it was so fun to write, and I've always felt that others with a similar upbringing to mine would especially be able to have fun with it. Like with \"Nairobi Tofauti\", I had long felt an urge to re-release this song with the beat I wrote it to.</p><p>Unlike \"Nairobi Tofauti\", however, I had to re-record this song in my bedroom because I didn't have the acapella track for it; AndyBolo had put in the acapella track for \"Safari-con Remake\" instead by mistake when he sent me the final masters for <em>Not a Rapper</em>. I saw that as an opportunity to match the vibe of the original beat, and I was very pleased with the result.</p><p>My inspiration for the flow on the second verse came from \"Meet the Woo\" by the late New York drill rapper Pop Smoke. He raps in a similar fashion towards the end of his verse and since I'd been listening to a lot of his music when I wrote <em>Not a Rapper</em>, it's no surprise that he ended up being an influence on this song as he has been on countless other drill tracks.</p><p>S'Bling did a superb job with the beat by the way. It still kinda surprises me that a Nigerian man living in the Ukraine could produce something like that, also bearing in mind that he's made himself known primarily for making afrobeats.</p>",
            "lyrics": "<div class=\"section\"> <h2>Intro</h2> <p>Ehen, DVK</p> <p class=\"ad-lib\">(S'Bling on the track)</p> <p>This one's for all my slay kings doing their thing out here in Nairobi, man</p> <p>Watu wa kuchukua Uber na si Umoinner</p> <p>Watu wa kudishi Kempinski, not kibandaski</p> <p>Ayy</p></div><div class=\"section\"> <h2>Chorus</h2> <p><span class=\"ad-lib\">(Ehen)</span></p> <p>Nganya <span class=\"ad-lib\">(ayy)</span>, wezi <span class=\"ad-lib\">(Ayy)</span></p> <p>Panya <span class=\"ad-lib\">(ayy)</span>, deni <span class=\"ad-lib\">(Ehen)</span></p> <p>Hizo ndio vitu sipendi <span class=\"ad-lib\">(Hizo ndio vitu sipendi)</span></p> <p>Piga <span class=\"ad-lib\">(ayy)</span>, densi <span class=\"ad-lib\">(Ayy)</span></p> <p>Sitaki <span class=\"ad-lib\">(ayy)</span>, penzi <span class=\"ad-lib\">(Ayy)</span></p> <p>Shenzi <span class=\"ad-lib\">(My fren)</span></p> <p>Hizo ndio vitu sipendi <span class=\"ad-lib\">(Hizo ndio vitu sipendi)</span></p></div><div class=\"section\"> <h2>Verse 1</h2> <p>Mi na ma-bro tuko rieng <span class=\"ad-lib\">(Tuko rieng)</span></p> <p>Tuko ma-drinks na mayeng <span class=\"ad-lib\">(Na mayeng)</span></p> <p>Kuna mmoja ameninoki <span class=\"ad-lib\">(Ayy)</span></p> <p>Anadai mjulubeng <span class=\"ad-lib\">(Ehen)</span></p> <p>Lakini mi niko hungry</p> <p>Mi nasaka tu msosi</p> <p>Options ni mchezo <span class=\"ad-lib\">(Ai!)</span></p> <p>Kumbe Kevo si mdosi</p> <p>Ati migingo na teargas <span class=\"ad-lib\">(Ah!)</span></p> <p>Hizo ni nini? <span class=\"ad-lib\">(Hizo ni nini?)</span></p> <p>Leta maharagwe na pasta <span class=\"ad-lib\">(Ayy)</span></p> <p>Na soda mbili</p> <p>Juzi niliona dem akidarwa <span class=\"ad-lib\">(Uh?)</span></p> <p>Huko jijini <span class=\"ad-lib\">(Huko jijini?)</span></p> <p>Wanashangaa ati nani ananyamba?</p> <p>Buda si mimi <span class=\"ad-lib\">(Buda si mimi)</span></p></div><div class=\"section\"> <h2>Chorus</h2> <p><span class=\"ad-lib\">(Ehen)</span></p> <p>Nganya <span class=\"ad-lib\">(ayy)</span>, wezi <span class=\"ad-lib\">(Ayy)</span></p> <p>Panya <span class=\"ad-lib\">(ayy)</span>, deni <span class=\"ad-lib\">(Ehen)</span></p> <p>Hizo ndio vitu sipendi <span class=\"ad-lib\">(Hizo ndio vitu sipendi)</span></p> <p>Piga <span class=\"ad-lib\">(ayy)</span>, densi <span class=\"ad-lib\">(Ayy)</span></p> <p>Sitaki <span class=\"ad-lib\">(ayy)</span>, penzi <span class=\"ad-lib\">(Ayy)</span></p> <p>Shenzi <span class=\"ad-lib\">(My fren)</span></p> <p>Hizo ndio vitu sipendi</p></div><div class=\"section\"> <h2>Verse 2</h2> <p>Ni wikendi <span class=\"ad-lib\">(Ayy)</span></p> <p>Tunaenda party <span class=\"ad-lib\">(Ayy)</span></p> <p>Kila mtu ako barley <span class=\"ad-lib\">(Ayy)</span></p> <p>Shawty <span class=\"ad-lib\">(Ehen)</span></p> <p>Leta nare <span class=\"ad-lib\">(Ayy)</span></p> <p>Washa ngem hapo ndani <span class=\"ad-lib\">(Ayy)</span></p> <p>DVK <span class=\"ad-lib\">(Ehen)</span></p> <p>Flows kibao, lazima <span class=\"ad-lib\">(Ayy)</span></p> <p>Hizi line nizi-ration <span class=\"ad-lib\">(My fren)</span></p> <p>Wekwa chobo</p> <p>Pigwa bare kama Rachel</p> <p>Rachel, Rachel <span class=\"ad-lib\">(Ehen)</span></p></div><div class=\"section\"> <h2>Chorus</h2> <p>Nganya <span class=\"ad-lib\">(ayy)</span>, wezi <span class=\"ad-lib\">(Ayy)</span></p> <p>Panya <span class=\"ad-lib\">(ayy)</span>, deni <span class=\"ad-lib\">(Ehen)</span></p> <p>Hizo ndio vitu sipendi <span class=\"ad-lib\">(Hizo ndio vitu sipendi)</span></p> <p>Piga <span class=\"ad-lib\">(ayy)</span>, densi <span class=\"ad-lib\">(Ayy)</span></p> <p>Sitaki <span class=\"ad-lib\">(ayy)</span>, penzi <span class=\"ad-lib\">(Ayy)</span></p> <p>Shenzi <span class=\"ad-lib\">(My fren)</span></p> <p>Hizo ndio vitu sipendi <span class=\"ad-lib\">(Hizo ndio vitu sipendi)</span></p></div>",
            "credits": {
                "writers": ["Davy Kamanzi", "Onuche Samuel Ogboji"],
                "producers": ["S'Bling"],
                "arrangement": ["S'Bling"],
                "mixMaster": ["Black Hole Records"],
                "recorded": [{
                    "studio": "DVK's bedroom",
                    "city": "Nairobi, Kenya"
                }]
            },
            "missingFrom": ["expanded", "base"]
        },
        {
            "id": "17",
            "title": "Only (Remix)",
            "runtime": "",
            "style": ["Afro rap", "Afropop"],
            "synopsis": "",
            "lyrics": "<div class=\"section\"><h2>Verse 1</h2><p>Poppa <span class=\"ad-lib\">(Yuh know)</span></p><p>Nyi mkicheza brikicho, bantura</p><p>Mi na-burn tu maua, nikikagua warembo</p><p>Nimekaza mwendo, nina-drip na mwenendo</p><p>Hivi vipusa wahoji kila asubuhi, jioni</p><p>Kinuthia ni nani? Kamuulize Andrew Kibe</p><p>Mi ni Mr. Bombastic, si Lambastic</p><p>Ajenda ni moja: Nikupe hiki chombo cha ajab</p><p>Mwishowe ukatii, huenda ukawa mkewe wa Poppa</p><p>Gwenteke, gwenteke</p><p>Kila kitu jo ni gwenteke</p><p>Ka ni kupepeta, nirudie nipepete, repete</p><p>I mean your body enticing, let me show you good time with</p><p>Dunda, hepi</p><p>Hanye, everyday</p><p>I mean, true, you are the one</p><p>Malkia, binti, true, you are the one!</p></div><div class=\"section\"><h2>Verse 2</h2><p>She's my black queen, my baby special</p><p>Anytime she come around, I'm sentimental <span class=\"ad-lib\">(Sentimental)</span></p><p>She challenge me from the physical to the mental</p><p>So much so, I'm putting paper to pencil <span class=\"ad-lib\">(To the pencil)</span></p><p>Wait, no, pencil to paper</p><p>Fucking up my lines but I don't need no eraser</p><p>'Cause she love me for who I am, all my flavours</p><p>Even when I get under her skin like a sabre</p><p>Pushing all her buttons like a calculator</p><p>But she glad she have a man who can calculate her <span class=\"ad-lib\">(Calculate, calculate me now)</span></p><p>The way she whine her waist, her body one to savour</p><p>A nutter when I'm mashing up her flower like a baker <span class=\"ad-lib\">(Like a baker)</span></p><p>Still got a couple man who would wanna date her</p><p>Wanna get their hands on what her mama gave her</p><p>Serving blue ticks, it's routine</p><p>'Cause she happy with her boo, know what I mean?</p></div><div class=\"section\"><h2>Chorus</h2><p>Brown skin with the natural hair <span class=\"ad-lib\">(Oooh, natural hair)</span></p><p>Anytime you're down, you know I'll always be there</p><p>'Cause losing you, babe, I know I can't bear</p><p>You're my only one, the other ones don't compare</p><p>I need your affection <span class=\"ad-lib\">(I need your affection)</span></p><p>The way you hold me down, I need you in my section</p><p>Such a star from your toes to your face <span class=\"ad-lib\">(From your toes to your face)</span></p><p>Baby, there's no question <span class=\"ad-lib\">(Ain't no question asked)</span></p></div><div class=\"section\"><h2>Verse 3</h2><p>Yuh, shawty bad, shawty from the East <span class=\"ad-lib\">(East)</span></p><p>Always looking like a meal, and I love a feast <span class=\"ad-lib\">(For real)</span></p><p>Pressure <span class=\"ad-lib\">(Pressure)</span>, yeah, she pushing P</p><p>Effortlessly in her bag, and I stan a queen</p><p>Shawty bad <span class=\"ad-lib\">(Shawty bad)</span>, I thought I told you</p><p>Hold the ends down even when I'm not local</p><p>G's move in silence, but right now I'm vocal</p><p>The way she holds me down, feels just like how it's supposed to be <span class=\"ad-lib\">(What?)</span></p><p>That's why I like her close to me</p><p>Ain't nobody gon' shine like we <span class=\"ad-lib\">(Ayy)</span></p><p>Penzi tamu kama asali</p><p>Bad gyal, Celine</p><p>Yeah, I feel for your affection <span class=\"ad-lib\">(Uh-huh)</span></p><p>And I'ma hold you down, I'm in your section <span class=\"ad-lib\">(In your section)</span></p><p>Ayy, they can't break this connection <span class=\"ad-lib\">(For real)</span></p><p>Huh, chop life, we no be stressin'</p><p>Yuh</p></div><div class=\"section\"><h2>Chorus</h2><p>Brown skin with the natural hair <span class=\"ad-lib\">(I need)</span></p><p>Anytime you're down, you know I'll always be there</p><p>'Cause losing you, babe, I know I can't bear <span class=\"ad-lib\">(Woooah)</span></p><p>You're my only one, the other ones don't compare <span class=\"ad-lib\">(Ayy)</span></p><p>I need your affection</p><p>The way you hold me down, I need you in my section</p><p>Such a star from your toes to your face</p><p>Baby, there's no question <span class=\"ad-lib\">(Yeh)</span></p></div>",
            "credits": {
                "writers": ["Davy Kamanzi", "Kevin Midonzi", "Alex Niragira", "Don Doulo", "Daryl Kimani"],
                "featuring": ["Don Poppa", "Thee MC G'zay"],
                "producers": ["KDaGreat"],
                "arrangement": ["KDaGreat", "Thee MC G'zay", "DVK"],
                "additionalVocals": ["Zippie Nyumu"],
                "mixMaster": ["Thee MC G'zay"],
                "recorded": [{
                        "studio": "Black Hole Records",
                        "city": "Nairobi, Kenya"
                    },
                    {
                        "studio": "Lati Ace",
                        "city": "Nairobi, Kenya"
                    },
                    {
                        "studio": "ApolloCoustic Productions",
                        "city": "Nakuru, Kenya"
                    }
                ]
            },
            "missingFrom": ["expanded", "mixtape", "base"]
        }
    ]
}